imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <sys/random.h>
#include "rp2350/cpu_config.h"
#include "rp2350/rp2350_mmio.h"
#include "rp2350/rp2350_usb.h"
#include "rp2350/rp2350_coproc.h"
#include "rp2350/rp2350_bootrom.h"
#include "m33mu/gpio.h"
#include "m33mu/otp.h"

extern void mm_system_request_reset(void);

#define RESETS_BASE   0x40020000u
#define RESETS_SIZE   0x1000u
#define CLOCKS_BASE   0x40010000u
#define CLOCKS_SIZE   0x1000u
#define IO_BANK0_BASE 0x40028000u
#define IO_BANK0_SIZE 0x1000u
#define IO_QSPI_BASE  0x40030000u
#define IO_QSPI_SIZE  0x1000u
#define PADS_BANK0_BASE 0x40038000u
#define PADS_BANK0_SIZE 0x1000u
#define PADS_QSPI_BASE  0x40040000u
#define PADS_QSPI_SIZE  0x1000u
#define PSM_BASE 0x40018000u
#define PSM_SIZE 0x10u
#define XOSC_BASE 0x40048000u
#define XOSC_SIZE 0x1000u
#define PLL_SYS_BASE 0x40050000u
#define PLL_SYS_SIZE 0x1000u
#define PLL_USB_BASE 0x40058000u
#define PLL_USB_SIZE 0x1000u
#define TIMER0_BASE 0x400b0000u
#define TIMER0_SIZE 0x1000u
#define TIMER1_BASE 0x400b8000u
#define TIMER1_SIZE 0x1000u
#define HSTX_CTRL_BASE 0x400c0000u
#define HSTX_CTRL_SIZE 0x1000u
#define XIP_CTRL_BASE 0x400c8000u
#define XIP_CTRL_SIZE 0x1000u
#define XIP_QMI_BASE  0x400d0000u
#define XIP_QMI_SIZE  0x1000u
#define XIP_AUX_BASE  0x50500000u
#define XIP_AUX_SIZE  0x1000u
#define XIP_MAINT_BASE 0x18000000u
#define XIP_MAINT_SIZE 0x04000000u
#define HSTX_FIFO_BASE 0x50600000u
#define HSTX_FIFO_SIZE 0x1000u
#define BOOTRAM_BASE  0x400e0000u
#define BOOTRAM_SIZE  0x1000u
#define BOOTRAM_FLASH_DEVINFO_OFFSET 0x200u
#define BOOTRAM_PARTITION_TABLE_OFFSET 0x0f60u
#define BOOTRAM_BOOT2_STUB_WORD 0x00004770u
#define TICKS_BASE 0x40108000u
#define TICKS_SIZE 0x1000u
#define ACCESS_CTRL_BASE 0x40060000u
#define ACCESS_CTRL_SIZE 0x100u
#define SIO_BASE      0xd0000000u
#define SIO_SIZE      0x1000u
#define BOOTROM_BASE  0x00000000u
#define BOOTROM_SIZE  0x1000u
#define SYSINFO_BASE  0x40000000u
#define SYSINFO_SIZE  0x1000u
#define SYSCFG_BASE   0x40008000u
#define SYSCFG_SIZE   0x1000u
#define PIO0_BASE     0x50200000u
#define PIO1_BASE     0x50300000u
#define PIO2_BASE     0x50400000u
#define PIO_SIZE      0x1000u
#define TRNG_BASE     0x400f0000u
#define TRNG_SIZE     0x1000u

#define PSM_FRCE_ON    0x000u
#define PSM_FRCE_OFF   0x004u
#define PSM_FRCE_ON_PROC1  (1u << 24)
#define PSM_FRCE_OFF_PROC1 (1u << 24)

#define SIO_FIFO_ST    0x050u
#define SIO_FIFO_WR    0x054u
#define SIO_FIFO_RD    0x058u
#define SIO_DOORBELL_OUT_SET 0x180u
#define SIO_DOORBELL_OUT_CLR 0x184u
#define SIO_DOORBELL_IN_SET  0x188u
#define SIO_DOORBELL_IN_CLR  0x18cu

#define SIO_IRQ_FIFO 25u
#define SIO_IRQ_BELL 26u

#define RESETS_RESET      0x000u
#define RESETS_WDSEL      0x004u
#define RESETS_RESET_DONE 0x008u

#define CLK_REF_CTRL      0x030u
#define CLK_REF_SELECTED  0x038u
#define CLK_SYS_CTRL      0x03cu
#define CLK_SYS_SELECTED  0x044u
#define CLK_PERI_CTRL     0x048u

#define CLK_PERI_CTRL_ENABLE_BIT 11u
#define CLK_PERI_CTRL_ENABLED_BIT 28u

#define HSTX_CTRL_CSR 0x000u

#define XIP_STAT 0x008u
#define XIP_STAT_FIFO_FULL  (1u << 2)
#define XIP_STAT_FIFO_EMPTY (1u << 1)
#define XIP_STREAM_ADDR 0x014u
#define XIP_STREAM_CTR  0x018u
#define XIP_STREAM_FIFO 0x01cu

#define RP2350_FLASH_SECTOR_SIZE 4096u
#define RP2350_PICOBIN_PARTITION_PERMISSION_S_R_BITS 0x04000000u
#define RP2350_PICOBIN_PARTITION_PERMISSION_S_W_BITS 0x08000000u
#define RP2350_PICOBIN_PARTITION_PERMISSION_NS_R_BITS 0x10000000u
#define RP2350_PICOBIN_PARTITION_PERMISSION_NS_W_BITS 0x20000000u
#define RP2350_PICOBIN_PARTITION_PERMISSION_NSBOOT_R_BITS 0x40000000u
#define RP2350_PICOBIN_PARTITION_PERMISSION_NSBOOT_W_BITS 0x80000000u
#define RP2350_PICOBIN_PARTITION_PERMISSIONS_BITS 0xfc000000u

#define RP2350_OTP_CMD_ROW_BITS 0x0000ffffu
#define RP2350_OTP_CMD_WRITE_BITS 0x00010000u
#define RP2350_OTP_CMD_ECC_BITS 0x00020000u

#define RP2350_BOOTROM_ERROR_NOT_PERMITTED ((mm_u32)0u - 4u)
#define RP2350_BOOTROM_ERROR_INVALID_ARG ((mm_u32)0u - 5u)
#define RP2350_BOOTROM_ERROR_BAD_ALIGNMENT ((mm_u32)0u - 11u)
#define RP2350_BOOTROM_ERROR_UNSUPPORTED_MODIFICATION ((mm_u32)0u - 18u)

#define RP2350_OTP_ROW_COUNT 0x800u
#define RP2350_OTP_ROW_BYTES 32u
#define RP2350_OTP_SW_LOCK_COUNT 64u
#define HSTX_FIFO_STAT 0x000u
#define HSTX_FIFO_FIFO 0x004u
#define HSTX_FIFO_STAT_LEVEL_MASK 0x000000ffu
#define HSTX_FIFO_STAT_FULL  (1u << 8)
#define HSTX_FIFO_STAT_EMPTY (1u << 9)
#define HSTX_FIFO_STAT_WOF   (1u << 10)

#define QMI_DIRECT_CSR 0x000u
#define QMI_DIRECT_TX  0x004u
#define QMI_DIRECT_RX  0x008u
#define QMI_DIRECT_CSR_RXLEVEL_SHIFT 18u
#define QMI_DIRECT_CSR_TXLEVEL_SHIFT 12u
#define QMI_DIRECT_CSR_RXFULL_BIT 17u
#define QMI_DIRECT_CSR_RXEMPTY_BIT 16u
#define QMI_DIRECT_CSR_TXEMPTY_BIT 11u
#define QMI_DIRECT_CSR_TXFULL_BIT 10u
#define QMI_DIRECT_CSR_AUTO_CS1N_BIT 7u
#define QMI_DIRECT_CSR_AUTO_CS0N_BIT 6u
#define QMI_DIRECT_CSR_ASSERT_CS1N_BIT 3u
#define QMI_DIRECT_CSR_ASSERT_CS0N_BIT 2u
#define QMI_DIRECT_CSR_BUSY_BIT 1u
#define QMI_DIRECT_CSR_EN_BIT 0u
#define QMI_DIRECT_CSR_WRITE_MASK 0xffc000cdu
#define QMI_DIRECT_CSR_RESET 0x01800000u
#define QMI_DIRECT_TX_NOPUSH_BIT 20u
#define QMI_DIRECT_TX_DWIDTH_BIT 18u
#define CLK_PERI_CTRL_KILL_BIT 10u

#define SIO_GPIO_IN       0x004u
#define SIO_GPIO_HI_IN    0x008u
#define SIO_GPIO_OUT      0x010u
#define SIO_GPIO_HI_OUT   0x014u
#define SIO_GPIO_OUT_SET  0x018u
#define SIO_GPIO_HI_OUT_SET 0x01cu
#define SIO_GPIO_OUT_CLR  0x020u
#define SIO_GPIO_HI_OUT_CLR 0x024u
#define SIO_GPIO_OUT_XOR  0x028u
#define SIO_GPIO_HI_OUT_XOR 0x02cu
#define SIO_GPIO_OE       0x030u
#define SIO_GPIO_HI_OE    0x034u
#define SIO_GPIO_OE_SET   0x038u
#define SIO_GPIO_HI_OE_SET 0x03cu
#define SIO_GPIO_OE_CLR   0x040u
#define SIO_GPIO_HI_OE_CLR 0x044u
#define SIO_GPIO_OE_XOR   0x048u
#define SIO_GPIO_HI_OE_XOR 0x04cu

#define BOOTRAM_WRITE_ONCE0 0x800u
#define BOOTRAM_WRITE_ONCE1 0x804u
#define BOOTRAM_BOOTLOCK_STAT 0x808u
#define BOOTRAM_BOOTLOCK0 0x80cu
#define BOOTRAM_BOOTLOCK7 0x828u

#define ACCESS_CONTROL_LOCK        0x0000u
#define ACCESS_CONTROL_FORCE_CORE_NS 0x0004u
#define ACCESS_CONTROL_CFGRESET    0x0008u
#define ACCESS_CONTROL_GPIOMASK0   0x000cu
#define ACCESS_CONTROL_GPIOMASK1   0x0010u
#define ACCESS_CONTROL_ROM         0x0014u
#define ACCESS_CONTROL_XIP_MAIN    0x0018u
#define ACCESS_CONTROL_SRAM_BASE   0x001cu
#define ACCESS_CONTROL_DMA         0x0044u
#define ACCESS_CONTROL_USBCTRL     0x0048u
#define ACCESS_CONTROL_PIO0        0x004cu
#define ACCESS_CONTROL_PIO1        0x0050u
#define ACCESS_CONTROL_PIO2        0x0054u
#define ACCESS_CONTROL_CORESIGHT_TRACE 0x0058u
#define ACCESS_CONTROL_CORESIGHT_PERIPH 0x005cu
#define ACCESS_CONTROL_SYSINFO     0x0060u
#define ACCESS_CONTROL_RESETS      0x0064u
#define ACCESS_CONTROL_IO_BANK0    0x0068u
#define ACCESS_CONTROL_IO_BANK1    0x006cu
#define ACCESS_CONTROL_PADS_BANK0  0x0070u
#define ACCESS_CONTROL_PADS_QSPI   0x0074u
#define ACCESS_CONTROL_BUSCTRL     0x0078u
#define ACCESS_CONTROL_ADC         0x007cu
#define ACCESS_CONTROL_HSTX        0x0080u
#define ACCESS_CONTROL_I2C0        0x0084u
#define ACCESS_CONTROL_I2C1        0x0088u
#define ACCESS_CONTROL_PWM         0x008cu
#define ACCESS_CONTROL_SPI0        0x0090u
#define ACCESS_CONTROL_SPI1        0x0094u
#define ACCESS_CONTROL_TIMER0      0x0098u
#define ACCESS_CONTROL_TIMER1      0x009cu
#define ACCESS_CONTROL_UART0       0x00a0u
#define ACCESS_CONTROL_UART1       0x00a4u
#define ACCESS_CONTROL_OTP         0x00a8u
#define ACCESS_CONTROL_TBMAN       0x00acu
#define ACCESS_CONTROL_POWMAN      0x00b0u
#define ACCESS_CONTROL_TRNG        0x00b4u
#define ACCESS_CONTROL_SHA256      0x00b8u
#define ACCESS_CONTROL_SYSCFG      0x00bcu
#define ACCESS_CONTROL_CLOCKS      0x00c0u
#define ACCESS_CONTROL_XOSC        0x00c4u
#define ACCESS_CONTROL_ROSC        0x00c8u
#define ACCESS_CONTROL_PLL_SYS     0x00ccu
#define ACCESS_CONTROL_PLL_USB     0x00d0u
#define ACCESS_CONTROL_TICKS       0x00d4u
#define ACCESS_CONTROL_WATCHDOG    0x00d8u
#define ACCESS_CONTROL_PSM         0x00dcu
#define ACCESS_CONTROL_XIP_CTRL    0x00e0u
#define ACCESS_CONTROL_XIP_QMI     0x00e4u
#define ACCESS_CONTROL_XIP_AUX     0x00e8u

