imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
#define ACCESS_BITS_DBG (1u << 7)
#define ACCESS_BITS_DMA (1u << 6)
#define ACCESS_BITS_CORE1 (1u << 5)
#define ACCESS_BITS_CORE0 (1u << 4)
#define ACCESS_BITS_SP    (1u << 3)
#define ACCESS_BITS_SU    (1u << 2)
#define ACCESS_BITS_NSP   (1u << 1)
#define ACCESS_BITS_NSU   (1u << 0)
#define ACCESS_MAGIC 0xACCE0000u

#define UART0_BASE 0x40070000u
#define UART1_BASE 0x40078000u
#define SPI0_BASE  0x40080000u
#define SPI1_BASE  0x40088000u
#define UART_SIZE 0x2000u
#define SPI_SIZE  0x1000u
#define USB_BASE  0x50110000u
#define USB_SIZE  0x4000u
#define USB_DPRAM_BASE 0x50100000u
#define USB_DPRAM_SIZE 0x1000u
#define DMA_BASE 0x50000000u
#define DMA_SIZE 0x1000u
#define WATCHDOG_BASE 0x400d8000u
#define WATCHDOG_SIZE 0x1000u
#define OTP_BASE 0x40120000u
#define OTP_SIZE 0x1000u
#define MMIO_ALIAS_SIZE 0x4000u

#define DMA_CH0_READ_ADDR 0x000u
#define DMA_CH0_WRITE_ADDR 0x004u
#define DMA_CH0_TRANS_COUNT 0x008u
#define DMA_CH0_CTRL_TRIG 0x00cu
#define DMA_CH0_AL1_CTRL 0x010u
#define DMA_CH0_AL1_READ_ADDR 0x014u
#define DMA_CH0_AL1_WRITE_ADDR 0x018u
#define DMA_CH0_AL1_TRANS_COUNT_TRIG 0x01cu
#define DMA_CH0_AL2_CTRL 0x020u
#define DMA_CH0_AL2_TRANS_COUNT 0x024u
#define DMA_CH0_AL2_READ_ADDR 0x028u
#define DMA_CH0_AL2_WRITE_ADDR_TRIG 0x02cu
#define DMA_CH0_AL3_CTRL 0x030u
#define DMA_CH0_AL3_WRITE_ADDR 0x034u
#define DMA_CH0_AL3_TRANS_COUNT 0x038u
#define DMA_CH0_AL3_READ_ADDR_TRIG 0x03cu

#define DMA_CTRL_EN_BIT 0u
#define DMA_CTRL_DATA_SIZE_SHIFT 2u
#define DMA_CTRL_INCR_READ_BIT 4u
#define DMA_CTRL_INCR_WRITE_BIT 6u
#define DMA_CTRL_BUSY_BIT 26u
#define DMA_CTRL_BUSY (1u << DMA_CTRL_BUSY_BIT)

#define WATCHDOG_CTRL 0x000u
#define WATCHDOG_LOAD 0x004u
#define WATCHDOG_REASON 0x008u
#define WATCHDOG_CTRL_TRIGGER_BIT 31u
#define WATCHDOG_REASON_TIMER (1u << 0)
#define WATCHDOG_REASON_FORCE (1u << 1)

struct reset_state {
    mm_u32 regs[RESETS_SIZE / 4u];
};

struct clock_state {
    mm_u32 regs[CLOCKS_SIZE / 4u];
};

struct sio_state {
    mm_u32 out_lo;
    mm_u32 out_hi;
    mm_u32 oe_lo;
    mm_u32 oe_hi;
    mm_u32 in_lo;
    mm_u32 in_hi;
    mm_u32 regs[SIO_SIZE / 4u];
};

struct psm_state {
    mm_u32 frce_on;
    mm_u32 frce_off;
};

struct rp2350_fifo {
    mm_u32 buf[8];
    mm_u8 head;
    mm_u8 tail;
    mm_u8 count;
};

struct rp2350_hstx_fifo {
    mm_u32 buf[16];
    mm_u8 head;
    mm_u8 tail;
    mm_u8 count;
    mm_u8 wof;
};

struct rp2350_qmi_fifo {
    mm_u16 buf[8];
    mm_u8 head;
    mm_u8 tail;
    mm_u8 count;
};

struct rp2350_multicore_state {
    struct rp2350_fifo rx[2];
    mm_u8 wof[2];
    mm_u8 roe[2];
    mm_u32 doorbell_in[2];
    mm_u32 core1_state; /* 0=off, 1=bootrom, 2=running */
    mm_u32 launch_pending;
    mm_u32 launch_vtor;
    mm_u32 launch_sp;
    mm_u32 launch_entry;
    mm_u32 boot_seq;
    mm_u32 active_core;
    struct mm_cpu *cpu[2];
    struct mm_nvic *nvic[2];
    mm_u32 *active_core_ptr;
};

struct bank_regs {
    mm_u32 regs[0x1000u / 4u];
};

static struct reset_state resets;
static struct clock_state clocks;
static struct sio_state sio;
static struct psm_state psm;
static struct rp2350_multicore_state rp2350_mc;
static struct bank_regs io_bank0;
static struct bank_regs io_qspi;
static struct bank_regs pads_bank0;
static struct bank_regs pads_qspi;
static struct bank_regs xosc;
static struct bank_regs pll_sys;
static struct bank_regs pll_usb;
static struct bank_regs hstx_ctrl;
static struct bank_regs xip_ctrl;
static struct bank_regs xip_aux;
static struct bank_regs qmi_regs;
static struct bank_regs watchdog;
static struct bank_regs bootram;
static struct bank_regs ticks;
static struct bank_regs sysinfo;
static struct bank_regs syscfg;
static struct bank_regs pio0;
static struct bank_regs pio1;
static struct bank_regs pio2;
static struct bank_regs trng;
static struct rp2350_hstx_fifo hstx_fifo;
static struct rp2350_qmi_fifo qmi_rx;
static struct rp2350_qmi_fifo qmi_tx;
static struct {
    mm_u32 sw_lock[RP2350_OTP_SW_LOCK_COUNT];
    struct mm_otp otp;
} otp_state;
static struct rp2350_boot_info rp2350_boot_info;
static mm_u32 rp2350_watchdog_reason_pending = 0u;
static struct {
    mm_u32 read_addr;
    mm_u32 write_addr;
    mm_u32 transfer_count;
    mm_u32 ctrl;
} dma_ch0;
static struct {
    mm_u32 lock;
    mm_u32 force_core_ns;
    mm_u32 gpio_mask0;
    mm_u32 gpio_mask1;
    mm_u32 rom;
    mm_u32 xip_main;
    mm_u32 sram[10];
    mm_u32 dma;
    mm_u32 usbctrl;
    mm_u32 pio0;
    mm_u32 pio1;
    mm_u32 pio2;
    mm_u32 coresight_trace;
    mm_u32 coresight_periph;
    mm_u32 sysinfo;
    mm_u32 resets;
    mm_u32 io_bank0;
    mm_u32 io_bank1;
    mm_u32 pads_bank0;
    mm_u32 pads_qspi;
    mm_u32 busctrl;
    mm_u32 adc;
    mm_u32 hstx;
    mm_u32 i2c0;
    mm_u32 i2c1;
    mm_u32 pwm;
    mm_u32 spi0;
    mm_u32 spi1;
    mm_u32 timer0;
    mm_u32 timer1;
    mm_u32 uart0;
    mm_u32 uart1;
    mm_u32 otp;
    mm_u32 tbman;
    mm_u32 powman;
    mm_u32 trng;
    mm_u32 sha256;
    mm_u32 syscfg;
    mm_u32 clocks;
    mm_u32 xosc;
    mm_u32 rosc;
    mm_u32 pll_sys;
    mm_u32 pll_usb;
    mm_u32 ticks;
    mm_u32 watchdog;
    mm_u32 psm;
    mm_u32 xip_ctrl;
    mm_u32 xip_qmi;
    mm_u32 xip_aux;
} access_ctrl;
static mm_bool rp2350_active = MM_FALSE;
static struct {
    mm_u8 *flash;
    mm_u32 flash_size;
    const struct mm_flash_persist *persist;
} rp2350_flash;

static struct rp2350_partition_table *rp2350_partition_table_ptr(void)
{
    return (struct rp2350_partition_table *)&bootram.regs[BOOTRAM_PARTITION_TABLE_OFFSET / 4u];
}

static const struct rp2350_partition_table *rp2350_partition_table_ptr_const(void)
{
    return (const struct rp2350_partition_table *)&bootram.regs[BOOTRAM_PARTITION_TABLE_OFFSET / 4u];
}

static void rp2350_partition_table_init(void)
{
    struct rp2350_partition_table *pt = rp2350_partition_table_ptr();
    if (pt == 0) return;
    memset(pt, 0, sizeof(*pt));
    pt->loaded = 1u;
    pt->unpartitioned_space_permissions_and_flags =
        RP2350_PICOBIN_PARTITION_PERMISSION_NSBOOT_R_BITS |
        RP2350_PICOBIN_PARTITION_PERMISSION_NSBOOT_W_BITS;
}

