imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
void mm_rp2350_boot_info_reset(void)
{
    memset(&rp2350_boot_info, 0, sizeof(rp2350_boot_info));
}

void mm_rp2350_set_boot_info(mm_i8 diagnostic_partition,
                             mm_u8 boot_type,
                             mm_i8 partition,
                             mm_u8 tbyb_info,
                             mm_u32 boot_diagnostic,
                             mm_u32 reboot_param0,
                             mm_u32 reboot_param1)
{
    mm_u32 boot_word = 0u;
    boot_word |= (mm_u32)(mm_u8)diagnostic_partition;
    boot_word |= ((mm_u32)boot_type) << 8;
    boot_word |= ((mm_u32)(mm_u8)partition) << 16;
    boot_word |= ((mm_u32)tbyb_info) << 24;
    rp2350_boot_info.boot_word = boot_word;
    rp2350_boot_info.boot_diagnostic = boot_diagnostic;
    rp2350_boot_info.reboot_params[0] = reboot_param0;
    rp2350_boot_info.reboot_params[1] = reboot_param1;
}

static mm_u32 rp2350_flash_devinfo_value(mm_u32 flash_size)
{
    mm_u32 size_k;
    mm_u32 val = 0u;
    if (flash_size < 8192u) return 0u;
    size_k = flash_size / 8192u;
    while (size_k > 0u && val < 0x1fu) {
        size_k >>= 1u;
        val++;
    }
    if (val > 0x0fu) val = 0x0fu;
    return (val << 8) & 0x00000f00u;
}

static mm_u32 read_slice(mm_u32 reg, mm_u32 offset_in_reg, mm_u32 size_bytes);
static mm_bool bank_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out);
static mm_bool bank_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value);

static mm_u32 access_default_bits(void)
{
    return ACCESS_BITS_SP | ACCESS_BITS_SU | ACCESS_BITS_NSP | ACCESS_BITS_NSU;
}

static void access_ctrl_reset(void)
{
    mm_u32 def = access_default_bits();
    size_t i;
    access_ctrl.lock = 0u;
    access_ctrl.force_core_ns = 0u;
    access_ctrl.gpio_mask0 = 0xffffffffu;
    access_ctrl.gpio_mask1 = 0xffffffffu;
    access_ctrl.rom = def;
    access_ctrl.xip_main = def;
    for (i = 0; i < 10u; ++i) {
        access_ctrl.sram[i] = def;
    }
    access_ctrl.dma = def;
    access_ctrl.usbctrl = def;
    access_ctrl.pio0 = def;
    access_ctrl.pio1 = def;
    access_ctrl.pio2 = def;
    access_ctrl.coresight_trace = def;
    access_ctrl.coresight_periph = def;
    access_ctrl.sysinfo = def;
    access_ctrl.resets = def;
    access_ctrl.io_bank0 = def;
    access_ctrl.io_bank1 = def;
    access_ctrl.pads_bank0 = def;
    access_ctrl.pads_qspi = def;
    access_ctrl.busctrl = def;
    access_ctrl.adc = def;
    access_ctrl.hstx = def;
    access_ctrl.i2c0 = def;
    access_ctrl.i2c1 = def;
    access_ctrl.pwm = def;
    access_ctrl.spi0 = def;
    access_ctrl.spi1 = def;
    access_ctrl.timer0 = def;
    access_ctrl.timer1 = def;
    access_ctrl.uart0 = def;
    access_ctrl.uart1 = def;
    access_ctrl.otp = def;
    access_ctrl.tbman = def;
    access_ctrl.powman = def;
    access_ctrl.trng = def;
    access_ctrl.sha256 = def;
    access_ctrl.syscfg = def;
    access_ctrl.clocks = def;
    access_ctrl.xosc = def;
    access_ctrl.rosc = def;
    access_ctrl.pll_sys = def;
    access_ctrl.pll_usb = def;
    access_ctrl.ticks = def;
    access_ctrl.watchdog = def;
    access_ctrl.psm = def;
    access_ctrl.xip_ctrl = def;
    access_ctrl.xip_qmi = def;
    access_ctrl.xip_aux = def;
}

static mm_u32 access_mask_lo(enum mm_sec_state sec)
{
    return (sec == MM_NONSECURE) ? access_ctrl.gpio_mask0 : 0xffffffffu;
}

static mm_u32 access_mask_hi(enum mm_sec_state sec)
{
    return (sec == MM_NONSECURE) ? access_ctrl.gpio_mask1 : 0xffffffffu;
}

static mm_u32 *access_ctrl_reg_for_offset(mm_u32 offset, mm_bool *is_mask_out)
{
    if (is_mask_out != 0) *is_mask_out = MM_FALSE;
    switch (offset) {
    case ACCESS_CONTROL_LOCK: return &access_ctrl.lock;
    case ACCESS_CONTROL_FORCE_CORE_NS: return &access_ctrl.force_core_ns;
    case ACCESS_CONTROL_CFGRESET: return 0;
    case ACCESS_CONTROL_GPIOMASK0: if (is_mask_out) *is_mask_out = MM_TRUE; return &access_ctrl.gpio_mask0;
    case ACCESS_CONTROL_GPIOMASK1: if (is_mask_out) *is_mask_out = MM_TRUE; return &access_ctrl.gpio_mask1;
    case ACCESS_CONTROL_ROM: return &access_ctrl.rom;
    case ACCESS_CONTROL_XIP_MAIN: return &access_ctrl.xip_main;
    case ACCESS_CONTROL_DMA: return &access_ctrl.dma;
    case ACCESS_CONTROL_USBCTRL: return &access_ctrl.usbctrl;
    case ACCESS_CONTROL_PIO0: return &access_ctrl.pio0;
    case ACCESS_CONTROL_PIO1: return &access_ctrl.pio1;
    case ACCESS_CONTROL_PIO2: return &access_ctrl.pio2;
    case ACCESS_CONTROL_CORESIGHT_TRACE: return &access_ctrl.coresight_trace;
    case ACCESS_CONTROL_CORESIGHT_PERIPH: return &access_ctrl.coresight_periph;
    case ACCESS_CONTROL_SYSINFO: return &access_ctrl.sysinfo;
    case ACCESS_CONTROL_RESETS: return &access_ctrl.resets;
    case ACCESS_CONTROL_IO_BANK0: return &access_ctrl.io_bank0;
    case ACCESS_CONTROL_IO_BANK1: return &access_ctrl.io_bank1;
    case ACCESS_CONTROL_PADS_BANK0: return &access_ctrl.pads_bank0;
    case ACCESS_CONTROL_PADS_QSPI: return &access_ctrl.pads_qspi;
    case ACCESS_CONTROL_BUSCTRL: return &access_ctrl.busctrl;
    case ACCESS_CONTROL_ADC: return &access_ctrl.adc;
    case ACCESS_CONTROL_HSTX: return &access_ctrl.hstx;
    case ACCESS_CONTROL_I2C0: return &access_ctrl.i2c0;
    case ACCESS_CONTROL_I2C1: return &access_ctrl.i2c1;
    case ACCESS_CONTROL_PWM: return &access_ctrl.pwm;
    case ACCESS_CONTROL_SPI0: return &access_ctrl.spi0;
    case ACCESS_CONTROL_SPI1: return &access_ctrl.spi1;
    case ACCESS_CONTROL_TIMER0: return &access_ctrl.timer0;
    case ACCESS_CONTROL_TIMER1: return &access_ctrl.timer1;
    case ACCESS_CONTROL_UART0: return &access_ctrl.uart0;
    case ACCESS_CONTROL_UART1: return &access_ctrl.uart1;
    case ACCESS_CONTROL_OTP: return &access_ctrl.otp;
    case ACCESS_CONTROL_TBMAN: return &access_ctrl.tbman;
    case ACCESS_CONTROL_POWMAN: return &access_ctrl.powman;
    case ACCESS_CONTROL_TRNG: return &access_ctrl.trng;
    case ACCESS_CONTROL_SHA256: return &access_ctrl.sha256;
    case ACCESS_CONTROL_SYSCFG: return &access_ctrl.syscfg;
    case ACCESS_CONTROL_CLOCKS: return &access_ctrl.clocks;
    case ACCESS_CONTROL_XOSC: return &access_ctrl.xosc;
    case ACCESS_CONTROL_ROSC: return &access_ctrl.rosc;
    case ACCESS_CONTROL_PLL_SYS: return &access_ctrl.pll_sys;
    case ACCESS_CONTROL_PLL_USB: return &access_ctrl.pll_usb;
    case ACCESS_CONTROL_TICKS: return &access_ctrl.ticks;
    case ACCESS_CONTROL_WATCHDOG: return &access_ctrl.watchdog;
    case ACCESS_CONTROL_PSM: return &access_ctrl.psm;
    case ACCESS_CONTROL_XIP_CTRL: return &access_ctrl.xip_ctrl;
    case ACCESS_CONTROL_XIP_QMI: return &access_ctrl.xip_qmi;
    case ACCESS_CONTROL_XIP_AUX: return &access_ctrl.xip_aux;
    default:
        break;
    }
    if (offset >= ACCESS_CONTROL_SRAM_BASE && offset < ACCESS_CONTROL_SRAM_BASE + 10u * 4u) {
        mm_u32 idx = (offset - ACCESS_CONTROL_SRAM_BASE) / 4u;
        return &access_ctrl.sram[idx];
    }
    return 0;
}

static mm_u32 access_ctrl_reg_for_addr(mm_u32 addr)
{
    if (addr < BOOTROM_BASE + BOOTROM_SIZE) return access_ctrl.rom;
    if (rp2350_flash.flash_size != 0u &&
        addr >= RP2350_FLASH_BASE_S &&
        addr < RP2350_FLASH_BASE_S + rp2350_flash.flash_size) {
        return access_ctrl.xip_main;
    }
    if (addr >= RP2350_RAM_BASE_S && addr < RP2350_RAM_BASE_S + RP2350_RAM_SIZE) {
        mm_u32 offs = addr - RP2350_RAM_BASE_S;
        if (offs < 0x80000u) {
            return access_ctrl.sram[(offs / 0x10000u) & 0x7u];
        }
        if (offs >= 0x80000u && offs < 0x81000u) {
            return access_ctrl.sram[8];
        }
        if (offs >= 0x81000u && offs < 0x82000u) {
            return access_ctrl.sram[9];
        }
    }
    if (addr >= RESETS_BASE && addr < RESETS_BASE + RESETS_SIZE) return access_ctrl.resets;
    if (addr >= CLOCKS_BASE && addr < CLOCKS_BASE + CLOCKS_SIZE) return access_ctrl.clocks;
    if (addr >= IO_BANK0_BASE && addr < IO_BANK0_BASE + IO_BANK0_SIZE) return access_ctrl.io_bank0;
    if (addr >= IO_QSPI_BASE && addr < IO_QSPI_BASE + IO_QSPI_SIZE) return access_ctrl.io_bank1;
    if (addr >= PADS_BANK0_BASE && addr < PADS_BANK0_BASE + PADS_BANK0_SIZE) return access_ctrl.pads_bank0;
    if (addr >= PADS_QSPI_BASE && addr < PADS_QSPI_BASE + PADS_QSPI_SIZE) return access_ctrl.pads_qspi;
    if (addr >= HSTX_CTRL_BASE && addr < HSTX_CTRL_BASE + HSTX_CTRL_SIZE) return access_ctrl.hstx;
    if (addr >= XIP_CTRL_BASE && addr < XIP_CTRL_BASE + XIP_CTRL_SIZE) return access_ctrl.xip_ctrl;
    if (addr >= XIP_QMI_BASE && addr < XIP_QMI_BASE + XIP_QMI_SIZE) return access_ctrl.xip_qmi;
    if (addr >= XIP_AUX_BASE && addr < XIP_AUX_BASE + XIP_AUX_SIZE) return access_ctrl.xip_aux;
    if (addr >= HSTX_FIFO_BASE && addr < HSTX_FIFO_BASE + HSTX_FIFO_SIZE) return access_ctrl.hstx;
    if (addr >= BOOTRAM_BASE && addr < BOOTRAM_BASE + BOOTRAM_SIZE) return 0u;
    if (addr >= TIMER0_BASE && addr < TIMER0_BASE + TIMER0_SIZE) return access_ctrl.timer0;
    if (addr >= TIMER1_BASE && addr < TIMER1_BASE + TIMER1_SIZE) return access_ctrl.timer1;
    if (addr >= UART0_BASE && addr < UART0_BASE + UART_SIZE) return access_ctrl.uart0;
    if (addr >= UART1_BASE && addr < UART1_BASE + UART_SIZE) return access_ctrl.uart1;
    if (addr >= SPI0_BASE && addr < SPI0_BASE + SPI_SIZE) return access_ctrl.spi0;
    if (addr >= SPI1_BASE && addr < SPI1_BASE + SPI_SIZE) return access_ctrl.spi1;
    if (addr >= USB_BASE && addr < USB_BASE + USB_SIZE) return access_ctrl.usbctrl;
    if (addr >= USB_DPRAM_BASE && addr < USB_DPRAM_BASE + USB_DPRAM_SIZE) return access_ctrl.usbctrl;
    return 0u;
}

static mm_bool access_ctrl_allow(mm_u32 reg, enum mm_sec_state sec, mm_bool privileged)
{
    mm_u32 bits = reg & 0xffu;
    if (access_ctrl.force_core_ns != 0u) {
        sec = MM_NONSECURE;
    }
    if (sec == MM_SECURE) {
        return privileged ? ((bits & ACCESS_BITS_SP) != 0u) : ((bits & ACCESS_BITS_SU) != 0u);
    }
    return privileged ? ((bits & ACCESS_BITS_NSP) != 0u) : ((bits & ACCESS_BITS_NSU) != 0u);
}

static mm_bool access_ctrl_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    mm_u32 *reg;
    mm_bool is_mask = MM_FALSE;
    mm_u32 val = 0u;
    (void)opaque;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    reg = access_ctrl_reg_for_offset(offset & ~3u, &is_mask);
    if (reg == 0) {
        val = 0u;
    } else {
        val = *reg;
    }
    if (!is_mask && (offset != ACCESS_CONTROL_LOCK) && (offset != ACCESS_CONTROL_FORCE_CORE_NS)) {
        val &= 0xffu;
    }
    *value_out = read_slice(val, offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool access_ctrl_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 *reg;
    mm_bool is_mask = MM_FALSE;
    (void)opaque;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset & 3u) != 0u || size_bytes != 4u) return MM_FALSE;

    if (offset == ACCESS_CONTROL_CFGRESET) {
        if ((value & 0xffff0000u) == ACCESS_MAGIC) {
            access_ctrl_reset();
        }
        return MM_TRUE;
    }
    if (offset == ACCESS_CONTROL_LOCK) {
        if ((value & 0xffff0000u) == ACCESS_MAGIC) {
            access_ctrl.lock = value;
        }
        return MM_TRUE;
    }
    if (access_ctrl.lock != 0u) {
        return MM_TRUE;
    }
    if ((value & 0xffff0000u) != ACCESS_MAGIC) {
        return MM_TRUE;
    }
    reg = access_ctrl_reg_for_offset(offset, &is_mask);
    if (reg == 0) return MM_TRUE;
    if (is_mask) {
        *reg = value;
    } else if (offset == ACCESS_CONTROL_FORCE_CORE_NS) {
        *reg = value;
    } else {
        *reg = value & 0xffu;
    }
    return MM_TRUE;
}

static mm_u32 read_slice(mm_u32 reg, mm_u32 offset_in_reg, mm_u32 size_bytes)
{
    mm_u32 shift = offset_in_reg * 8u;
    mm_u32 mask = (size_bytes == 4u) ? 0xffffffffu : ((1u << (size_bytes * 8u)) - 1u);
    return (reg >> shift) & mask;
}

static mm_u32 apply_write(mm_u32 cur, mm_u32 offset_in_reg, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 shift = offset_in_reg * 8u;
    mm_u32 mask = (size_bytes == 4u) ? 0xffffffffu : ((1u << (size_bytes * 8u)) - 1u);
    mm_u32 shifted = (value & mask) << shift;
    return (cur & ~(mask << shift)) | shifted;
}

static mm_u32 rp2350_active_core(void)
{
    if (rp2350_mc.active_core_ptr != 0) {
        return *rp2350_mc.active_core_ptr;
    }
    return rp2350_mc.active_core;
}

static void rp2350_fifo_clear(struct rp2350_fifo *fifo)
{
    fifo->head = 0;
    fifo->tail = 0;
    fifo->count = 0;
}

static mm_bool rp2350_fifo_push(struct rp2350_fifo *fifo, mm_u32 value)
{
    if (fifo->count >= 8u) {
        return MM_FALSE;
    }
    fifo->buf[fifo->head] = value;
    fifo->head = (mm_u8)((fifo->head + 1u) & 7u);
    fifo->count++;
    return MM_TRUE;
}

static mm_bool rp2350_fifo_pop(struct rp2350_fifo *fifo, mm_u32 *value_out)
{
    if (fifo->count == 0u) {
        return MM_FALSE;
    }
    *value_out = fifo->buf[fifo->tail];
    fifo->tail = (mm_u8)((fifo->tail + 1u) & 7u);
    fifo->count--;
    return MM_TRUE;
}

static mm_u32 rp2350_fifo_status(mm_u32 core_id)
{
    mm_u32 vld = (rp2350_mc.rx[core_id].count != 0u) ? 1u : 0u;
    mm_u32 rdy = (rp2350_mc.rx[1u - core_id].count < 8u) ? 1u : 0u;
    mm_u32 wof = rp2350_mc.wof[core_id] ? 1u : 0u;
    mm_u32 roe = rp2350_mc.roe[core_id] ? 1u : 0u;
    return (vld << 0) | (rdy << 1) | (wof << 2) | (roe << 3);
}

static void rp2350_fifo_update_irq(mm_u32 core_id)
{
    struct mm_nvic *nvic = rp2350_mc.nvic[core_id];
    mm_u32 status = rp2350_fifo_status(core_id);
    if (nvic == 0) return;
    if ((status & 0xdu) != 0u) {
        mm_nvic_set_pending(nvic, SIO_IRQ_FIFO, MM_TRUE);
    } else {
        mm_nvic_set_pending(nvic, SIO_IRQ_FIFO, MM_FALSE);
    }
}

static void hstx_fifo_clear(struct rp2350_hstx_fifo *fifo)
{
    if (fifo == 0) return;
    fifo->head = 0u;
    fifo->tail = 0u;
    fifo->count = 0u;
    fifo->wof = 0u;
}

static mm_bool hstx_fifo_push(struct rp2350_hstx_fifo *fifo, mm_u32 value)
{
    if (fifo == 0) return MM_FALSE;
    if (fifo->count >= 16u) {
        fifo->wof = 1u;
        return MM_FALSE;
    }
    fifo->buf[fifo->head] = value;
    fifo->head = (mm_u8)((fifo->head + 1u) & 15u);
    fifo->count++;
    return MM_TRUE;
}

static mm_u32 hstx_fifo_status(struct rp2350_hstx_fifo *fifo)
{
    mm_u32 level;
    mm_u32 status;
    if (fifo == 0) return 0u;
    level = fifo->count & 0xffu;
    status = level;
    if (fifo->count == 0u) status |= HSTX_FIFO_STAT_EMPTY;
    if (fifo->count >= 16u) status |= HSTX_FIFO_STAT_FULL;
    if (fifo->wof != 0u) status |= HSTX_FIFO_STAT_WOF;
    return status;
}

static void qmi_fifo_clear(struct rp2350_qmi_fifo *fifo)
{
    if (fifo == 0) return;
    fifo->head = 0u;
    fifo->tail = 0u;
    fifo->count = 0u;
}

static mm_bool qmi_fifo_push(struct rp2350_qmi_fifo *fifo, mm_u16 value)
{
    if (fifo == 0) return MM_FALSE;
    if (fifo->count >= 8u) return MM_FALSE;
    fifo->buf[fifo->head] = value;
    fifo->head = (mm_u8)((fifo->head + 1u) & 7u);
    fifo->count++;
    return MM_TRUE;
}

