imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
static mm_bool qmi_fifo_pop(struct rp2350_qmi_fifo *fifo, mm_u16 *value_out)
{
    if (fifo == 0 || value_out == 0) return MM_FALSE;
    if (fifo->count == 0u) return MM_FALSE;
    *value_out = fifo->buf[fifo->tail];
    fifo->tail = (mm_u8)((fifo->tail + 1u) & 7u);
    fifo->count--;
    return MM_TRUE;
}

static void rp2350_doorbell_update_irq(mm_u32 core_id)
{
    struct mm_nvic *nvic = rp2350_mc.nvic[core_id];
    if (nvic == 0) return;
    if (rp2350_mc.doorbell_in[core_id] != 0u) {
        mm_nvic_set_pending(nvic, SIO_IRQ_BELL, MM_TRUE);
    } else {
        mm_nvic_set_pending(nvic, SIO_IRQ_BELL, MM_FALSE);
    }
}

static void rp2350_signal_event(mm_u32 core_id)
{
    if (core_id >= 2u) return;
    if (rp2350_mc.cpu[core_id] != 0) {
        rp2350_mc.cpu[core_id]->event_reg = MM_TRUE;
        rp2350_mc.cpu[core_id]->sleeping = MM_FALSE;
        rp2350_mc.cpu[core_id]->sleep_wfe = MM_FALSE;
    }
}

static mm_bool rp2350_bootrom_handle_word(mm_u32 cmd)
{
    static const mm_u32 fixed_seq[3] = {0u, 0u, 1u};
    mm_u32 seq = rp2350_mc.boot_seq;
    mm_bool accept = MM_TRUE;
    if (seq < 3u) {
        if (cmd != fixed_seq[seq]) {
            accept = MM_FALSE;
        }
    }
    if (!accept) {
        rp2350_mc.boot_seq = 0u;
        return MM_FALSE;
    }
    if (seq == 3u) rp2350_mc.launch_vtor = cmd;
    else if (seq == 4u) rp2350_mc.launch_sp = cmd;
    else if (seq == 5u) rp2350_mc.launch_entry = cmd;
    seq++;
    if (seq >= 6u) {
        rp2350_mc.boot_seq = 0u;
        rp2350_mc.launch_pending = 1u;
        rp2350_mc.core1_state = 2u;
    } else {
        rp2350_mc.boot_seq = seq;
    }
    return MM_TRUE;
}

static mm_u32 alias_base_offset(mm_u32 offset, mm_u32 *alias_out)
{
    mm_u32 alias = 0u;
    mm_u32 base = offset;
    if (offset >= 0x1000u && offset < MMIO_ALIAS_SIZE) {
        alias = (offset >> 12) & 0x3u;
        base = offset & 0xfffu;
    }
    if (alias_out != 0) {
        *alias_out = alias;
    }
    return base;
}

static mm_u32 alias_value(mm_u32 offset_in_reg, mm_u32 size_bytes, mm_u32 value)
{
    return apply_write(0u, offset_in_reg, size_bytes, value);
}

static void xosc_update_status(void)
{
    mm_u32 ctrl = xosc.regs[0];
    mm_u32 enable = (ctrl >> 12) & 0xfffu;
    mm_u32 freq = ctrl & 0xfffu;
    mm_u32 status = 0u;
    if (enable == 0x0fabu) {
        status |= (1u << 12) | (1u << 31);
    }
    switch (freq) {
    case 0x0aa0u: status |= 0u; break;
    case 0x0aa1u: status |= 1u; break;
    case 0x0aa2u: status |= 2u; break;
    case 0x0aa3u: status |= 3u; break;
    default: break;
    }
    xosc.regs[1] = status;
}

static void ticks_update_block(struct bank_regs *t)
{
    mm_u32 ctrl;
    mm_u32 cycles;
    int i;
    if (t == 0) return;
    for (i = 0; i < 6; ++i) {
        mm_u32 ctrl_idx = (mm_u32)(i * 3);
        mm_u32 cycles_idx = ctrl_idx + 1u;
        mm_u32 count_idx = ctrl_idx + 2u;
        ctrl = t->regs[ctrl_idx] & 0x3u;
        cycles = t->regs[cycles_idx] & 0x1ffu;
        if ((ctrl & 0x1u) != 0u) {
            ctrl |= 0x2u;
            if (cycles != 0u) {
                t->regs[count_idx] = cycles;
            } else {
                t->regs[count_idx] = 0u;
            }
        } else {
            ctrl &= ~0x2u;
            t->regs[count_idx] = 0u;
        }
        t->regs[ctrl_idx] = ctrl;
    }
}

static mm_bool bootram_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 lock_idx;
    mm_u32 lock_mask;
    if (b == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > BOOTRAM_SIZE) return MM_FALSE;
    if (offset == BOOTRAM_BOOTLOCK_STAT) {
        mm_u32 v = b->regs[offset / 4u] & 0xffu;
        *value_out = read_slice(v, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset >= BOOTRAM_BOOTLOCK0 && offset <= BOOTRAM_BOOTLOCK7) {
        lock_idx = (offset - BOOTRAM_BOOTLOCK0) / 4u;
        lock_mask = 1u << lock_idx;
        if ((b->regs[BOOTRAM_BOOTLOCK_STAT / 4u] & lock_mask) != 0u) {
            b->regs[BOOTRAM_BOOTLOCK_STAT / 4u] &= ~lock_mask;
            *value_out = read_slice(lock_mask, offset & 3u, size_bytes);
        } else {
            *value_out = 0u;
        }
        return MM_TRUE;
    }
    if (size_bytes != 4u) {
        return bank_read(b, offset, size_bytes, value_out);
    }
    *value_out = b->regs[offset / 4u];
    return MM_TRUE;
}

static mm_bool bootram_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 lock_idx;
    mm_u32 lock_mask;
    if (b == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > BOOTRAM_SIZE) return MM_FALSE;
    if (offset == BOOTRAM_WRITE_ONCE0 || offset == BOOTRAM_WRITE_ONCE1) {
        b->regs[offset / 4u] |= value;
        return MM_TRUE;
    }
    if (offset == BOOTRAM_BOOTLOCK_STAT) {
        mm_u32 reg = b->regs[offset / 4u] & 0xffu;
        reg = apply_write(reg, offset & 3u, size_bytes, value) & 0xffu;
        b->regs[offset / 4u] = reg;
        return MM_TRUE;
    }
    if (offset >= BOOTRAM_BOOTLOCK0 && offset <= BOOTRAM_BOOTLOCK7) {
        lock_idx = (offset - BOOTRAM_BOOTLOCK0) / 4u;
        lock_mask = 1u << lock_idx;
        b->regs[BOOTRAM_BOOTLOCK_STAT / 4u] |= lock_mask;
        b->regs[offset / 4u] = 0u;
        return MM_TRUE;
    }
    if (size_bytes != 4u) {
        return bank_write(b, offset, size_bytes, value);
    }
    b->regs[offset / 4u] = value;
    return MM_TRUE;
}

static mm_bool otp_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    mm_u32 idx;
    (void)opaque;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > OTP_SIZE) return MM_FALSE;
    idx = offset / 4u;
    if (idx < RP2350_OTP_SW_LOCK_COUNT) {
        *value_out = read_slice(otp_state.sw_lock[idx], offset & 3u, size_bytes);
        return MM_TRUE;
    }
    *value_out = 0u;
    return MM_TRUE;
}

