imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
static mm_bool otp_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 idx;
    (void)opaque;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > OTP_SIZE) return MM_FALSE;
    idx = offset / 4u;
    if (idx < RP2350_OTP_SW_LOCK_COUNT) {
        mm_u32 reg = otp_state.sw_lock[idx];
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        otp_state.sw_lock[idx] |= reg;
        return MM_TRUE;
    }
    return MM_TRUE;
}

static mm_bool watchdog_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    if (b == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > WATCHDOG_SIZE) return MM_FALSE;
    return bank_read(b, offset, size_bytes, value_out);
}

static mm_bool watchdog_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 reg;
    if (b == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > WATCHDOG_SIZE) return MM_FALSE;
    if (offset == WATCHDOG_REASON) {
        return MM_TRUE;
    }
    if (offset == WATCHDOG_CTRL) {
        reg = b->regs[offset / 4u];
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        if ((reg & (1u << WATCHDOG_CTRL_TRIGGER_BIT)) != 0u) {
            rp2350_watchdog_reason_pending = WATCHDOG_REASON_FORCE;
            mm_system_request_reset();
            reg &= ~(1u << WATCHDOG_CTRL_TRIGGER_BIT);
        }
        b->regs[offset / 4u] = reg;
        return MM_TRUE;
    }
    return bank_write(b, offset, size_bytes, value);
}

static void pll_update_status(struct bank_regs *pll)
{
    mm_u32 pwr;
    if (pll == 0) return;
    pwr = pll->regs[1];
    if ((pwr & 0x1u) == 0u && (pwr & 0x20u) == 0u) {
        pll->regs[0] |= (1u << 31);
    } else {
        pll->regs[0] &= ~(1u << 31);
    }
}

static mm_u32 reset_mask(void)
{
    return 0xffffffffu;
}

mm_bool mm_rp2350_reset_asserted(mm_u32 mask)
{
    return ((resets.regs[RESETS_RESET / 4u] & mask) != 0u) ? MM_TRUE : MM_FALSE;
}

mm_bool mm_rp2350_clock_peri_enabled(void)
{
    mm_u32 reg = clocks.regs[CLK_PERI_CTRL / 4u];
    mm_bool kill = ((reg >> CLK_PERI_CTRL_KILL_BIT) & 1u) != 0u;
    mm_bool enable = ((reg >> CLK_PERI_CTRL_ENABLE_BIT) & 1u) != 0u;
    return (enable && !kill) ? MM_TRUE : MM_FALSE;
}

mm_bool mm_rp2350_active(void)
{
    return rp2350_active;
}

static void sio_sync_inputs(void)
{
    sio.in_lo = sio.out_lo;
    sio.in_hi = sio.out_hi;
}

static mm_bool resets_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct reset_state *r = (struct reset_state *)opaque;
    mm_u32 val;
    mm_u32 alias;
    mm_u32 base_off;
    if (r == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;

    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > RESETS_SIZE) return MM_FALSE;
    if (base_off == RESETS_RESET_DONE && size_bytes == 4u) {
        val = ~r->regs[RESETS_RESET / 4u];
        val &= reset_mask();
        *value_out = val;
        return MM_TRUE;
    }
    (void)alias;
    *value_out = read_slice(r->regs[base_off / 4u], base_off & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool resets_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct reset_state *r = (struct reset_state *)opaque;
    mm_u32 alias;
    mm_u32 base_off;
    mm_u32 mask;
    if (r == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;

    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > RESETS_SIZE) return MM_FALSE;
    if (alias == 0u) {
        if (base_off == RESETS_RESET && size_bytes == 4u) {
            r->regs[RESETS_RESET / 4u] = value;
            return MM_TRUE;
        }
        r->regs[base_off / 4u] = apply_write(r->regs[base_off / 4u], base_off & 3u, size_bytes, value);
        return MM_TRUE;
    }
    mask = alias_value(base_off & 3u, size_bytes, value);
    switch (alias) {
    case 1u:
        r->regs[base_off / 4u] ^= mask;
        break;
    case 2u:
        r->regs[base_off / 4u] |= mask;
        break;
    case 3u:
        r->regs[base_off / 4u] &= ~mask;
        break;
    default:
        break;
    }
    return MM_TRUE;
}

static mm_bool clocks_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct clock_state *c = (struct clock_state *)opaque;
    mm_u32 val;
    mm_u32 alias;
    mm_u32 base_off;
    if (c == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;

    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > CLOCKS_SIZE) return MM_FALSE;
    if (base_off == CLK_PERI_CTRL && size_bytes == 4u) {
        val = c->regs[CLK_PERI_CTRL / 4u];
        if (mm_rp2350_clock_peri_enabled()) {
            val |= (1u << CLK_PERI_CTRL_ENABLED_BIT);
        } else {
            val &= ~(1u << CLK_PERI_CTRL_ENABLED_BIT);
        }
        *value_out = val;
        return MM_TRUE;
    }
    if (base_off == CLK_REF_SELECTED && size_bytes == 4u) {
        mm_u32 src = c->regs[CLK_REF_CTRL / 4u] & 0x3u;
        *value_out = (1u << src);
        return MM_TRUE;
    }
    if (base_off == CLK_SYS_SELECTED && size_bytes == 4u) {
        mm_u32 src = c->regs[CLK_SYS_CTRL / 4u] & 0x3u;
        *value_out = (1u << src);
        return MM_TRUE;
    }

    (void)alias;
    *value_out = read_slice(c->regs[base_off / 4u], base_off & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool clocks_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct clock_state *c = (struct clock_state *)opaque;
    mm_u32 alias;
    mm_u32 base_off;
    mm_u32 mask;
    if (c == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;

