imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > CLOCKS_SIZE) return MM_FALSE;
    if (alias == 0u) {
        c->regs[base_off / 4u] = apply_write(c->regs[base_off / 4u], base_off & 3u, size_bytes, value);
        return MM_TRUE;
    }
    mask = alias_value(base_off & 3u, size_bytes, value);
    switch (alias) {
    case 1u:
        c->regs[base_off / 4u] ^= mask;
        break;
    case 2u:
        c->regs[base_off / 4u] |= mask;
        break;
    case 3u:
        c->regs[base_off / 4u] &= ~mask;
        break;
    default:
        break;
    }
    return MM_TRUE;
}

static mm_bool psm_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct psm_state *p = (struct psm_state *)opaque;
    if (p == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset & 3u) != 0u || size_bytes != 4u) return MM_FALSE;
    if (offset == PSM_FRCE_ON) {
        *value_out = p->frce_on;
        return MM_TRUE;
    }
    if (offset == PSM_FRCE_OFF) {
        *value_out = p->frce_off;
        return MM_TRUE;
    }
    *value_out = 0u;
    return MM_TRUE;
}

static void rp2350_core1_reset(void)
{
    printf("[RP2350] core1 reset\n");
    rp2350_mc.core1_state = 0u;
    rp2350_mc.launch_pending = 0u;
    rp2350_mc.boot_seq = 0u;
    rp2350_mc.wof[1] = 0u;
    rp2350_mc.roe[1] = 0u;
    rp2350_fifo_clear(&rp2350_mc.rx[0]);
    rp2350_fifo_clear(&rp2350_mc.rx[1]);
    rp2350_fifo_update_irq(0u);
    rp2350_fifo_update_irq(1u);
}

static void rp2350_core1_release(void)
{
    printf("[RP2350] core1 released (bootrom)\n");
    rp2350_mc.core1_state = 1u;
    rp2350_mc.boot_seq = 0u;
    rp2350_mc.wof[1] = 0u;
    rp2350_mc.roe[1] = 0u;
    rp2350_fifo_clear(&rp2350_mc.rx[1]);
    (void)rp2350_fifo_push(&rp2350_mc.rx[0], 0u);
    rp2350_fifo_update_irq(0u);
    rp2350_signal_event(0u);
}

static mm_bool psm_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct psm_state *p = (struct psm_state *)opaque;
    mm_u32 prev_off;
    if (p == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset & 3u) != 0u || size_bytes != 4u) return MM_FALSE;
    if (offset == PSM_FRCE_ON) {
        p->frce_on = value;
        if (value & PSM_FRCE_ON_PROC1) {
            p->frce_off &= ~PSM_FRCE_OFF_PROC1;
            if (rp2350_mc.core1_state == 0u) {
                rp2350_core1_release();
            }
        }
        return MM_TRUE;
    }
    if (offset == PSM_FRCE_OFF) {
        prev_off = p->frce_off;
        p->frce_off = value;
        if ((value & PSM_FRCE_OFF_PROC1) != 0u) {
            rp2350_core1_reset();
        } else if ((prev_off & PSM_FRCE_OFF_PROC1) != 0u) {
            rp2350_core1_release();
        }
        return MM_TRUE;
    }
    return MM_TRUE;
}

static mm_bool sio_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct sio_state *s = (struct sio_state *)opaque;
    enum mm_sec_state sec = mmio_active_sec();
    mm_u32 mask_lo = access_mask_lo(sec);
    mm_u32 mask_hi = access_mask_hi(sec);
    mm_u32 core_id = rp2350_active_core() & 1u;
    mm_u32 val;
    if (s == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > SIO_SIZE) return MM_FALSE;

    if (offset == SIO_GPIO_IN && size_bytes == 4u) {
        sio_sync_inputs();
        *value_out = s->in_lo & mask_lo;
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_IN && size_bytes == 4u) {
        sio_sync_inputs();
        *value_out = s->in_hi & mask_hi;
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OUT && size_bytes == 4u) {
        *value_out = s->out_lo & mask_lo;
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OUT && size_bytes == 4u) {
        *value_out = s->out_hi & mask_hi;
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OE && size_bytes == 4u) {
        *value_out = s->oe_lo & mask_lo;
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OE && size_bytes == 4u) {
        *value_out = s->oe_hi & mask_hi;
        return MM_TRUE;
    }
    if (offset == SIO_FIFO_ST && size_bytes == 4u) {
        *value_out = rp2350_fifo_status(core_id);
        return MM_TRUE;
    }
    if (offset == SIO_FIFO_RD && size_bytes == 4u) {
        mm_u32 v = 0;
        if (!rp2350_fifo_pop(&rp2350_mc.rx[core_id], &v)) {
            rp2350_mc.roe[core_id] = 1u;
            rp2350_fifo_update_irq(core_id);
            *value_out = 0u;
            return MM_TRUE;
        }
        rp2350_fifo_update_irq(core_id);
        *value_out = v;
        return MM_TRUE;
    }
    if ((offset == SIO_DOORBELL_IN_CLR || offset == SIO_DOORBELL_IN_SET) && size_bytes == 4u) {
        *value_out = rp2350_mc.doorbell_in[core_id] & 0xffu;
        return MM_TRUE;
    }

    val = read_slice(s->regs[offset / 4u], offset & 3u, size_bytes);
    *value_out = val;
    return MM_TRUE;
}

static void sio_apply_write(mm_u32 *reg, mm_u32 value, mm_u32 kind)
{
    if (kind == 0u) {
        *reg = value;
    } else if (kind == 1u) {
        *reg |= value;
    } else if (kind == 2u) {
        *reg &= ~value;
    } else {
        *reg ^= value;
    }
}

static mm_bool sio_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct sio_state *s = (struct sio_state *)opaque;
    enum mm_sec_state sec = mmio_active_sec();
    mm_u32 mask_lo = access_mask_lo(sec);
    mm_u32 mask_hi = access_mask_hi(sec);
    mm_u32 core_id = rp2350_active_core() & 1u;
    mm_u32 other_id = core_id ^ 1u;
    if (s == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > SIO_SIZE) return MM_FALSE;

    if (offset == SIO_GPIO_OUT && size_bytes == 4u) {
        sio_apply_write(&s->out_lo, value & mask_lo, 0u);
        sio_sync_inputs();
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OUT && size_bytes == 4u) {
        sio_apply_write(&s->out_hi, value & mask_hi, 0u);
        sio_sync_inputs();
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OUT_SET && size_bytes == 4u) {
        sio_apply_write(&s->out_lo, value & mask_lo, 1u);
        sio_sync_inputs();
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OUT_SET && size_bytes == 4u) {
        sio_apply_write(&s->out_hi, value & mask_hi, 1u);
        sio_sync_inputs();
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OUT_CLR && size_bytes == 4u) {
        sio_apply_write(&s->out_lo, value & mask_lo, 2u);
        sio_sync_inputs();
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OUT_CLR && size_bytes == 4u) {
        sio_apply_write(&s->out_hi, value & mask_hi, 2u);
        sio_sync_inputs();
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OUT_XOR && size_bytes == 4u) {
        sio_apply_write(&s->out_lo, value & mask_lo, 3u);
        sio_sync_inputs();
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OUT_XOR && size_bytes == 4u) {
        sio_apply_write(&s->out_hi, value & mask_hi, 3u);
        sio_sync_inputs();
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OE && size_bytes == 4u) {
        sio_apply_write(&s->oe_lo, value & mask_lo, 0u);
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OE && size_bytes == 4u) {
        sio_apply_write(&s->oe_hi, value & mask_hi, 0u);
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OE_SET && size_bytes == 4u) {
        sio_apply_write(&s->oe_lo, value & mask_lo, 1u);
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OE_SET && size_bytes == 4u) {
        sio_apply_write(&s->oe_hi, value & mask_hi, 1u);
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OE_CLR && size_bytes == 4u) {
        sio_apply_write(&s->oe_lo, value & mask_lo, 2u);
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OE_CLR && size_bytes == 4u) {
        sio_apply_write(&s->oe_hi, value & mask_hi, 2u);
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_OE_XOR && size_bytes == 4u) {
        sio_apply_write(&s->oe_lo, value & mask_lo, 3u);
        return MM_TRUE;
    }
    if (offset == SIO_GPIO_HI_OE_XOR && size_bytes == 4u) {
        sio_apply_write(&s->oe_hi, value & mask_hi, 3u);
        return MM_TRUE;
    }
    if (offset == SIO_FIFO_ST && size_bytes == 4u) {
        if (value & (1u << 3)) rp2350_mc.roe[core_id] = 0u;
        if (value & (1u << 2)) rp2350_mc.wof[core_id] = 0u;
        rp2350_fifo_update_irq(core_id);
        return MM_TRUE;
    }
    if (offset == SIO_FIFO_WR && size_bytes == 4u) {
        if (core_id == 0u && rp2350_mc.core1_state == 1u) {
            mm_bool accept = rp2350_bootrom_handle_word(value);
            if (accept) {
                (void)rp2350_fifo_push(&rp2350_mc.rx[0], value);
            } else {
                (void)rp2350_fifo_push(&rp2350_mc.rx[0], 0u);
            }
            rp2350_fifo_update_irq(0u);
            rp2350_signal_event(0u);
            return MM_TRUE;
        }
        if (!rp2350_fifo_push(&rp2350_mc.rx[other_id], value)) {
            rp2350_mc.wof[core_id] = 1u;
            rp2350_fifo_update_irq(core_id);
            return MM_TRUE;
        }
        rp2350_fifo_update_irq(other_id);
        rp2350_signal_event(other_id);
        return MM_TRUE;
    }
    if (offset == SIO_DOORBELL_OUT_SET && size_bytes == 4u) {
        rp2350_mc.doorbell_in[other_id] |= (value & 0xffu);
        rp2350_doorbell_update_irq(other_id);
        rp2350_signal_event(other_id);
        return MM_TRUE;
    }
    if (offset == SIO_DOORBELL_OUT_CLR && size_bytes == 4u) {
        rp2350_mc.doorbell_in[other_id] &= ~(value & 0xffu);
        rp2350_doorbell_update_irq(other_id);
        return MM_TRUE;
    }
    if (offset == SIO_DOORBELL_IN_SET && size_bytes == 4u) {
        rp2350_mc.doorbell_in[core_id] |= (value & 0xffu);
        rp2350_doorbell_update_irq(core_id);
        return MM_TRUE;
    }
    if (offset == SIO_DOORBELL_IN_CLR && size_bytes == 4u) {
        rp2350_mc.doorbell_in[core_id] &= ~(value & 0xffu);
        rp2350_doorbell_update_irq(core_id);
        return MM_TRUE;
    }

