imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
    s->regs[offset / 4u] = apply_write(s->regs[offset / 4u], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

/* SYSINFO: Read-only chip information */
#define SYSINFO_CHIP_ID   0x00u
#define SYSINFO_PACKAGE_SEL 0x04u
#define SYSINFO_PLATFORM  0x08u
#define SYSINFO_GITREF_RP2350 0x14u

static mm_bool sysinfo_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    mm_u32 alias;
    mm_u32 base_off;
    (void)opaque;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;
    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    (void)alias;
    *value_out = read_slice(sysinfo.regs[base_off / 4u], base_off & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool sysinfo_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    (void)opaque;
    (void)offset;
    (void)size_bytes;
    (void)value;
    /* SYSINFO is read-only; ignore writes */
    return MM_TRUE;
}

/* PIO: Programmable I/O (stub implementation) */
#define PIO_CTRL      0x00u
#define PIO_FSTAT     0x04u
#define PIO_FDEBUG    0x08u
#define PIO_FLEVEL    0x0Cu
#define PIO_FSTAT_TXEMPTY_ALL 0x0F000000u
#define PIO_FSTAT_RXEMPTY_ALL 0x00000F00u

static mm_bool pio_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 alias;
    mm_u32 base_off;
    mm_u32 val;
    if (b == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;
    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    (void)alias;
    /* Special handling for FSTAT: all FIFOs empty */
    if (base_off == PIO_FSTAT && size_bytes == 4u) {
        *value_out = PIO_FSTAT_TXEMPTY_ALL | PIO_FSTAT_RXEMPTY_ALL;
        return MM_TRUE;
    }
    /* FLEVEL: all FIFO levels zero */
    if (base_off == PIO_FLEVEL && size_bytes == 4u) {
        *value_out = 0u;
        return MM_TRUE;
    }
    val = read_slice(b->regs[base_off / 4u], base_off & 3u, size_bytes);
    *value_out = val;
    return MM_TRUE;
}

static mm_bool pio_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 alias;
    mm_u32 base_off;
    mm_u32 mask;
    if (b == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;
    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    if (alias == 0u) {
        b->regs[base_off / 4u] = apply_write(b->regs[base_off / 4u], base_off & 3u, size_bytes, value);
        return MM_TRUE;
    }
    mask = alias_value(base_off & 3u, size_bytes, value);
    switch (alias) {
    case 1u: b->regs[base_off / 4u] ^= mask; break;
    case 2u: b->regs[base_off / 4u] |= mask; break;
    case 3u: b->regs[base_off / 4u] &= ~mask; break;
    default: break;
    }
    return MM_TRUE;
}

/* TRNG: True Random Number Generator */
#define TRNG_RNG_IMR          0x100u
#define TRNG_RNG_ISR          0x104u
#define TRNG_RNG_ICR          0x108u
#define TRNG_CONFIG           0x10Cu
#define TRNG_VALID            0x110u
#define TRNG_EHR_DATA0        0x114u
#define TRNG_EHR_DATA5        0x128u
#define TRNG_SOURCE_ENABLE    0x12Cu
#define TRNG_SAMPLE_CNT1      0x130u
#define TRNG_AUTOCORR_STAT    0x134u
#define TRNG_SW_RESET         0x140u
#define TRNG_BUSY             0x1B8u
#define TRNG_RST_BITS_COUNTER 0x1BCu
#define TRNG_RNG_VERSION      0x1C0u
#define TRNG_RNG_BIST_CNTR0   0x1E0u
#define TRNG_RNG_BIST_CNTR2   0x1E8u

static mm_bool trng_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    mm_u32 alias;
    mm_u32 base_off;
    (void)opaque;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;
    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    (void)alias;
    /* EHR_DATA0-5: Return random data */
    if (base_off >= TRNG_EHR_DATA0 && base_off <= TRNG_EHR_DATA5 && size_bytes == 4u) {
        mm_u32 rnd = 0;
        (void)getrandom(&rnd, sizeof(rnd), 0);
        *value_out = rnd;
        return MM_TRUE;
    }
    /* RNG_ISR: EHR_VALID bit always set */
    if (base_off == TRNG_RNG_ISR && size_bytes == 4u) {
        *value_out = 1u; /* EHR_VALID = 1 */
        return MM_TRUE;
    }
    /* TRNG_VALID: always valid */
    if (base_off == TRNG_VALID && size_bytes == 4u) {
        *value_out = 1u;
        return MM_TRUE;
    }
    /* TRNG_BUSY: never busy */
    if (base_off == TRNG_BUSY && size_bytes == 4u) {
        *value_out = 0u;
        return MM_TRUE;
    }
    *value_out = read_slice(trng.regs[base_off / 4u], base_off & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool trng_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 alias;
    mm_u32 base_off;
    mm_u32 mask;
    (void)opaque;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;
    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    if (alias == 0u) {
        trng.regs[base_off / 4u] = apply_write(trng.regs[base_off / 4u], base_off & 3u, size_bytes, value);
        return MM_TRUE;
    }
    mask = alias_value(base_off & 3u, size_bytes, value);
    switch (alias) {
    case 1u: trng.regs[base_off / 4u] ^= mask; break;
    case 2u: trng.regs[base_off / 4u] |= mask; break;
    case 3u: trng.regs[base_off / 4u] &= ~mask; break;
    default: break;
    }
    return MM_TRUE;
}

static mm_bool bank_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 alias;
    mm_u32 base_off;
    if (b == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;

