imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    (void)alias;
    *value_out = read_slice(b->regs[base_off / 4u], base_off & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool bank_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 alias;
    mm_u32 base_off;
    mm_u32 mask;
    if (b == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;

    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    if (alias == 0u) {
        b->regs[base_off / 4u] = apply_write(b->regs[base_off / 4u], base_off & 3u, size_bytes, value);
        return MM_TRUE;
    }
    mask = alias_value(base_off & 3u, size_bytes, value);
    switch (alias) {
    case 1u:
        b->regs[base_off / 4u] ^= mask;
        break;
    case 2u:
        b->regs[base_off / 4u] |= mask;
        break;
    case 3u:
        b->regs[base_off / 4u] &= ~mask;
        break;
    default:
        break;
    }
    return MM_TRUE;
}

static mm_bool hstx_fifo_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct rp2350_hstx_fifo *fifo = (struct rp2350_hstx_fifo *)opaque;
    if (fifo == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > HSTX_FIFO_SIZE) return MM_FALSE;
    if (offset == HSTX_FIFO_STAT) {
        *value_out = read_slice(hstx_fifo_status(fifo), offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == HSTX_FIFO_FIFO) {
        *value_out = 0u;
        return MM_TRUE;
    }
    *value_out = 0u;
    return MM_TRUE;
}

static mm_bool hstx_fifo_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct rp2350_hstx_fifo *fifo = (struct rp2350_hstx_fifo *)opaque;
    mm_u32 csr;
    if (fifo == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > HSTX_FIFO_SIZE) return MM_FALSE;
    if (offset == HSTX_FIFO_STAT) {
        if ((value & HSTX_FIFO_STAT_WOF) != 0u) {
            fifo->wof = 0u;
        }
        return MM_TRUE;
    }
    if (offset == HSTX_FIFO_FIFO) {
        csr = hstx_ctrl.regs[HSTX_CTRL_CSR / 4u];
        if ((csr & 1u) != 0u) {
            fifo->count = 0u;
            fifo->head = 0u;
            fifo->tail = 0u;
            return MM_TRUE;
        }
        (void)hstx_fifo_push(fifo, value);
        return MM_TRUE;
    }
    return MM_TRUE;
}

static mm_u32 qmi_direct_csr_value(void)
{
    mm_u32 reg = qmi_regs.regs[QMI_DIRECT_CSR / 4u] & QMI_DIRECT_CSR_WRITE_MASK;
    mm_u32 rxlevel = qmi_rx.count;
    mm_u32 txlevel = qmi_tx.count;
    mm_bool rxempty = (rxlevel == 0u);
    mm_bool rxfull = (rxlevel >= 8u);
    mm_bool txempty = (txlevel == 0u);
    mm_bool txfull = (rxlevel >= 8u);
    mm_bool busy = ((reg & (1u << QMI_DIRECT_CSR_EN_BIT)) != 0u) && !rxempty;

    reg |= (rxlevel << QMI_DIRECT_CSR_RXLEVEL_SHIFT) & 0x001c0000u;
    reg |= (txlevel << QMI_DIRECT_CSR_TXLEVEL_SHIFT) & 0x00007000u;
    if (rxfull) reg |= (1u << QMI_DIRECT_CSR_RXFULL_BIT);
    if (rxempty) reg |= (1u << QMI_DIRECT_CSR_RXEMPTY_BIT);
    if (txempty) reg |= (1u << QMI_DIRECT_CSR_TXEMPTY_BIT);
    if (txfull) reg |= (1u << QMI_DIRECT_CSR_TXFULL_BIT);
    if (busy) reg |= (1u << QMI_DIRECT_CSR_BUSY_BIT);
    return reg;
}

static mm_bool qmi_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    mm_u32 alias;
    mm_u32 base_off;
    mm_u16 value;
    (void)opaque;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;
    base_off = alias_base_offset(offset, &alias);
    (void)alias;
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    if (base_off == QMI_DIRECT_CSR) {
        *value_out = read_slice(qmi_direct_csr_value(), base_off & 3u, size_bytes);
        return MM_TRUE;
    }
    if (base_off == QMI_DIRECT_RX) {
        if (!qmi_fifo_pop(&qmi_rx, &value)) {
            value = 0xffu;
        }
        *value_out = read_slice((mm_u32)value, base_off & 3u, size_bytes);
        return MM_TRUE;
    }
    return bank_read(&qmi_regs, base_off, size_bytes, value_out);
}

static mm_bool qmi_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 alias;
    mm_u32 base_off;
    mm_u32 mask;
    mm_u32 reg;
    mm_u32 data;
    mm_bool nopush;
    mm_bool dwidth;
    (void)opaque;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > MMIO_ALIAS_SIZE) return MM_FALSE;
    base_off = alias_base_offset(offset, &alias);
    if ((base_off + size_bytes) > 0x1000u) return MM_FALSE;
    if (base_off == QMI_DIRECT_CSR) {
        reg = qmi_regs.regs[QMI_DIRECT_CSR / 4u] & QMI_DIRECT_CSR_WRITE_MASK;
        if (alias == 0u) {
            reg = apply_write(reg, base_off & 3u, size_bytes, value);
        } else {
            mask = alias_value(base_off & 3u, size_bytes, value);
            switch (alias) {
            case 1u:
                reg ^= mask;
                break;
            case 2u:
                reg |= mask;
                break;
            case 3u:
                reg &= ~mask;
                break;
            default:
                break;
            }
        }
        reg &= QMI_DIRECT_CSR_WRITE_MASK;
        qmi_regs.regs[QMI_DIRECT_CSR / 4u] = reg;
        if ((reg & (1u << QMI_DIRECT_CSR_EN_BIT)) == 0u) {
            qmi_fifo_clear(&qmi_rx);
            qmi_fifo_clear(&qmi_tx);
        }
        return MM_TRUE;
    }
    if (base_off == QMI_DIRECT_TX) {
        data = apply_write(0u, base_off & 3u, size_bytes, value);
        nopush = ((data >> QMI_DIRECT_TX_NOPUSH_BIT) & 1u) != 0u;
        dwidth = ((data >> QMI_DIRECT_TX_DWIDTH_BIT) & 1u) != 0u;
        if (!nopush) {
            mm_u16 rx_value = dwidth ? 0xffffu : 0x00ffu;
            (void)qmi_fifo_push(&qmi_rx, rx_value);
        }
        return MM_TRUE;
    }
    return bank_write(&qmi_regs, offset, size_bytes, value);
}

