imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
static mm_u32 xip_stream_read_word(void)
{
    struct mm_memmap *map = mm_memmap_current();
    mm_u32 addr = xip_ctrl.regs[XIP_STREAM_ADDR / 4u];
    mm_u32 remaining = xip_ctrl.regs[XIP_STREAM_CTR / 4u];
    mm_u32 value = 0u;
    if (remaining == 0u) return 0u;
    if (map != 0) {
        (void)mm_memmap_read(map, MM_NONSECURE, addr, 4u, &value);
    }
    xip_ctrl.regs[XIP_STREAM_ADDR / 4u] = addr + 4u;
    xip_ctrl.regs[XIP_STREAM_CTR / 4u] = remaining - 1u;
    return value;
}

static mm_bool xip_ctrl_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 stat;
    if (b == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > XIP_CTRL_SIZE) return MM_FALSE;
    if (offset == XIP_STAT) {
        stat = 0u;
        if (xip_ctrl.regs[XIP_STREAM_CTR / 4u] == 0u) {
            stat |= XIP_STAT_FIFO_EMPTY;
        }
        *value_out = read_slice(stat, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == XIP_STREAM_FIFO) {
        mm_u32 data = xip_stream_read_word();
        *value_out = read_slice(data, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    return bank_read(b, offset, size_bytes, value_out);
}

static mm_bool xip_ctrl_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    mm_u32 reg;
    if (b == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > XIP_CTRL_SIZE) return MM_FALSE;
    if (offset == XIP_STREAM_ADDR || offset == XIP_STREAM_CTR) {
        reg = b->regs[offset / 4u];
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        b->regs[offset / 4u] = reg;
        return MM_TRUE;
    }
    return bank_write(b, offset, size_bytes, value);
}

static void dma_do_transfer(void)
{
    struct mm_memmap *map = mm_memmap_current();
    mm_u32 count = dma_ch0.transfer_count & 0x0fffffffu;
    mm_u32 data_size = (dma_ch0.ctrl >> DMA_CTRL_DATA_SIZE_SHIFT) & 0x3u;
    mm_u32 step = (data_size == 0u) ? 1u : (data_size == 1u) ? 2u : 4u;
    mm_u32 read_addr = dma_ch0.read_addr;
    mm_u32 write_addr = dma_ch0.write_addr;
    mm_bool incr_read = ((dma_ch0.ctrl >> DMA_CTRL_INCR_READ_BIT) & 1u) != 0u;
    mm_bool incr_write = ((dma_ch0.ctrl >> DMA_CTRL_INCR_WRITE_BIT) & 1u) != 0u;
    mm_u32 i;
    mm_u32 value = 0u;

    dma_ch0.ctrl |= DMA_CTRL_BUSY;
    if (map != 0) {
        for (i = 0; i < count; ++i) {
            value = 0u;
            (void)mm_memmap_read(map, MM_NONSECURE, read_addr, step, &value);
            (void)mm_memmap_write(map, MM_NONSECURE, write_addr, step, value);
            if (incr_read) read_addr += step;
            if (incr_write) write_addr += step;
        }
    }
    dma_ch0.read_addr = read_addr;
    dma_ch0.write_addr = write_addr;
    dma_ch0.transfer_count &= 0xf0000000u;
    dma_ch0.ctrl &= ~(DMA_CTRL_BUSY | (1u << DMA_CTRL_EN_BIT));
}

static void dma_start_if_enabled(void)
{
    if ((dma_ch0.ctrl & (1u << DMA_CTRL_EN_BIT)) != 0u) {
        dma_do_transfer();
    }
}

static mm_bool dma_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    (void)opaque;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if (offset >= DMA_SIZE) return MM_FALSE;
    switch (offset) {
    case DMA_CH0_READ_ADDR:
        *value_out = read_slice(dma_ch0.read_addr, offset & 3u, size_bytes);
        return MM_TRUE;
    case DMA_CH0_WRITE_ADDR:
        *value_out = read_slice(dma_ch0.write_addr, offset & 3u, size_bytes);
        return MM_TRUE;
    case DMA_CH0_TRANS_COUNT:
        *value_out = read_slice(dma_ch0.transfer_count, offset & 3u, size_bytes);
        return MM_TRUE;
    case DMA_CH0_CTRL_TRIG:
    case DMA_CH0_AL1_CTRL:
    case DMA_CH0_AL2_CTRL:
    case DMA_CH0_AL3_CTRL:
        *value_out = read_slice(dma_ch0.ctrl, offset & 3u, size_bytes);
        return MM_TRUE;
    case DMA_CH0_AL1_READ_ADDR:
    case DMA_CH0_AL2_READ_ADDR:
    case DMA_CH0_AL3_READ_ADDR_TRIG:
        *value_out = read_slice(dma_ch0.read_addr, offset & 3u, size_bytes);
        return MM_TRUE;
    case DMA_CH0_AL1_WRITE_ADDR:
    case DMA_CH0_AL2_WRITE_ADDR_TRIG:
    case DMA_CH0_AL3_WRITE_ADDR:
        *value_out = read_slice(dma_ch0.write_addr, offset & 3u, size_bytes);
        return MM_TRUE;
    case DMA_CH0_AL1_TRANS_COUNT_TRIG:
    case DMA_CH0_AL2_TRANS_COUNT:
    case DMA_CH0_AL3_TRANS_COUNT:
        *value_out = read_slice(dma_ch0.transfer_count, offset & 3u, size_bytes);
        return MM_TRUE;
    default:
        *value_out = 0u;
        return MM_TRUE;
    }
}

static mm_bool dma_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 reg;
    (void)opaque;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if (offset >= DMA_SIZE) return MM_FALSE;
    switch (offset) {
    case DMA_CH0_READ_ADDR:
    case DMA_CH0_AL1_READ_ADDR:
    case DMA_CH0_AL2_READ_ADDR:
        reg = dma_ch0.read_addr;
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        dma_ch0.read_addr = reg;
        return MM_TRUE;
    case DMA_CH0_WRITE_ADDR:
    case DMA_CH0_AL1_WRITE_ADDR:
    case DMA_CH0_AL3_WRITE_ADDR:
        reg = dma_ch0.write_addr;
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        dma_ch0.write_addr = reg;
        return MM_TRUE;
    case DMA_CH0_TRANS_COUNT:
    case DMA_CH0_AL2_TRANS_COUNT:
    case DMA_CH0_AL3_TRANS_COUNT:
        reg = dma_ch0.transfer_count;
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        dma_ch0.transfer_count = reg;
        return MM_TRUE;
    case DMA_CH0_CTRL_TRIG:
    case DMA_CH0_AL1_CTRL:
    case DMA_CH0_AL2_CTRL:
    case DMA_CH0_AL3_CTRL:
        reg = dma_ch0.ctrl;
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        dma_ch0.ctrl = reg;
        dma_start_if_enabled();
        return MM_TRUE;
    case DMA_CH0_AL1_TRANS_COUNT_TRIG:
        reg = dma_ch0.transfer_count;
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        dma_ch0.transfer_count = reg;
        dma_start_if_enabled();
        return MM_TRUE;
    case DMA_CH0_AL2_WRITE_ADDR_TRIG:
        reg = dma_ch0.write_addr;
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        dma_ch0.write_addr = reg;
        dma_start_if_enabled();
        return MM_TRUE;
    case DMA_CH0_AL3_READ_ADDR_TRIG:
        reg = dma_ch0.read_addr;
        reg = apply_write(reg, offset & 3u, size_bytes, value);
        dma_ch0.read_addr = reg;
        dma_start_if_enabled();
        return MM_TRUE;
    default:
        return MM_TRUE;
    }
}

static mm_bool xip_aux_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    if (b == 0 || value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > XIP_AUX_SIZE) return MM_FALSE;
    if (offset == 0x000u) {
        mm_u32 data = xip_stream_read_word();
        *value_out = read_slice(data, offset & 3u, size_bytes);
        return MM_TRUE;
    }
    if (offset == 0x004u) {
        *value_out = 0u;
        return MM_TRUE;
    }
    if (offset == 0x008u) {
        return qmi_read(0, QMI_DIRECT_RX, size_bytes, value_out);
    }
    return bank_read(b, offset, size_bytes, value_out);
}

static mm_bool xip_aux_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct bank_regs *b = (struct bank_regs *)opaque;
    if (b == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > XIP_AUX_SIZE) return MM_FALSE;
    if (offset == 0x004u) {
        return qmi_write(0, QMI_DIRECT_TX, size_bytes, value);
    }
    if (offset == 0x008u) {
        return MM_TRUE;
    }
    return bank_write(b, offset, size_bytes, value);
}

