imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
static mm_bool xip_maint_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    (void)opaque;
    (void)offset;
    if (value_out == 0 || size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    *value_out = 0u;
    return MM_TRUE;
}

static mm_bool xip_maint_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    (void)opaque;
    (void)offset;
    (void)value;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    return MM_TRUE;
}

static mm_bool xosc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    (void)opaque;
    xosc_update_status();
    return bank_read(&xosc, offset, size_bytes, value_out);
}

static mm_bool xosc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    (void)opaque;
    if (!bank_write(&xosc, offset, size_bytes, value)) return MM_FALSE;
    xosc_update_status();
    return MM_TRUE;
}

static mm_bool pll_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct bank_regs *pll = (struct bank_regs *)opaque;
    if (pll == 0) return MM_FALSE;
    pll_update_status(pll);
    return bank_read(pll, offset, size_bytes, value_out);
}

static mm_bool pll_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct bank_regs *pll = (struct bank_regs *)opaque;
    if (pll == 0) return MM_FALSE;
    if (!bank_write(pll, offset, size_bytes, value)) return MM_FALSE;
    pll_update_status(pll);
    return MM_TRUE;
}

static mm_bool ticks_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    (void)opaque;
    ticks_update_block(&ticks);
    return bank_read(&ticks, offset, size_bytes, value_out);
}

static mm_bool ticks_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    (void)opaque;
    if (!bank_write(&ticks, offset, size_bytes, value)) return MM_FALSE;
    ticks_update_block(&ticks);
    return MM_TRUE;
}

static mm_u32 gpio_bank_out(int bank)
{
    mm_u32 out = 0u;
    if (bank == 0) {
        out = sio.out_lo & 0x0000ffffu;
    } else if (bank == 1) {
        out = (sio.out_lo >> 16) & 0x0000ffffu;
    } else if (bank == 2) {
        out = sio.out_hi & 0x0000ffffu;
    }
    return out;
}

static mm_u32 gpio_bank_moder(int bank)
{
    mm_u32 oe = 0u;
    mm_u32 moder = 0u;
    mm_u32 pin;
    if (bank == 0) {
        oe = sio.oe_lo & 0x0000ffffu;
    } else if (bank == 1) {
        oe = (sio.oe_lo >> 16) & 0x0000ffffu;
    } else if (bank == 2) {
        oe = sio.oe_hi & 0x0000ffffu;
    }
    for (pin = 0; pin < 16u; ++pin) {
        if ((oe >> pin) & 1u) {
            moder |= (1u << (pin * 2u));
        }
    }
    return moder;
}

static mm_u32 rp2350_gpio_bank_read(void *opaque, int bank)
{
    (void)opaque;
    return gpio_bank_out(bank);
}

static mm_u32 rp2350_gpio_bank_read_moder(void *opaque, int bank)
{
    (void)opaque;
    return gpio_bank_moder(bank);
}

static mm_bool rp2350_gpio_bank_clock(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank > 2) return MM_FALSE;
    if (mm_rp2350_reset_asserted(RP2350_RESET_IO_BANK0)) return MM_FALSE;
    return mm_rp2350_clock_peri_enabled();
}

static mm_bool rp2350_gpio_bank_info(void *opaque, int bank, char *name_out, size_t name_len, int *pins_out)
{
    (void)opaque;
    if (bank < 0 || bank > 2) return MM_FALSE;
    if (name_out != 0 && name_len > 0u) {
        int start = bank * 16;
        int end = start + 15;
        snprintf(name_out, name_len, "GPIO%d-%d", start, end);
    }
    if (pins_out != 0) {
        *pins_out = 16;
    }
    return MM_TRUE;
}

static mm_bool rp2350_clock_list_line(void *opaque, int line, char *out, size_t out_len)
{
    mm_u32 reg;
    mm_bool peri_on;
    (void)opaque;
    if (out == 0 || out_len == 0u) return MM_FALSE;
    if (line != 0) return MM_FALSE;

    reg = clocks.regs[CLK_PERI_CTRL / 4u];
    peri_on = ((reg >> CLK_PERI_CTRL_ENABLE_BIT) & 1u) != 0u;
    if (!peri_on) {
        return MM_FALSE;
    }
    snprintf(out, out_len, "CLOCKS: PERI");
    return MM_TRUE;
}

mm_bool mm_rp2350_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;

    if (bus == 0) return MM_FALSE;

    rp2350_active = MM_TRUE;
    mm_rp2350_coproc_reset();

    memset(&reg, 0, sizeof(reg));
    reg.size = BOOTROM_SIZE;
    reg.base = BOOTROM_BASE;
    reg.opaque = 0;
    reg.read = mm_rp2350_bootrom_read;
    reg.write = mm_rp2350_bootrom_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    memset(&reg, 0, sizeof(reg));
    reg.size = ACCESS_CTRL_SIZE;
    reg.base = ACCESS_CTRL_BASE;
    reg.opaque = 0;
    reg.read = access_ctrl_read;
    reg.write = access_ctrl_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    memset(&reg, 0, sizeof(reg));
    reg.size = MMIO_ALIAS_SIZE;
    reg.base = RESETS_BASE;
    reg.opaque = &resets;
    reg.read = resets_read;
    reg.write = resets_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = CLOCKS_BASE;
    reg.opaque = &clocks;
    reg.read = clocks_read;
    reg.write = clocks_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = PSM_SIZE;
    reg.base = PSM_BASE;
    reg.opaque = &psm;
    reg.read = psm_read;
    reg.write = psm_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = SIO_SIZE;
    reg.base = SIO_BASE;
    reg.opaque = &sio;
    reg.read = sio_read;
    reg.write = sio_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = IO_BANK0_BASE;
    reg.opaque = &io_bank0;
    reg.read = bank_read;
    reg.write = bank_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = IO_QSPI_BASE;
    reg.opaque = &io_qspi;
    reg.read = bank_read;
    reg.write = bank_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = PADS_BANK0_BASE;
    reg.opaque = &pads_bank0;
    reg.read = bank_read;
    reg.write = bank_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = PADS_QSPI_BASE;
    reg.opaque = &pads_qspi;
    reg.read = bank_read;
    reg.write = bank_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = XOSC_BASE;
    reg.opaque = &xosc;
    reg.read = xosc_read;
    reg.write = xosc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = PLL_SYS_BASE;
    reg.opaque = &pll_sys;
    reg.read = pll_read;
    reg.write = pll_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = PLL_USB_BASE;
    reg.opaque = &pll_usb;
    reg.read = pll_read;
    reg.write = pll_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = HSTX_CTRL_BASE;
    reg.opaque = &hstx_ctrl;
    reg.read = bank_read;
    reg.write = bank_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = XIP_CTRL_BASE;
    reg.opaque = &xip_ctrl;
    reg.read = xip_ctrl_read;
    reg.write = xip_ctrl_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = XIP_QMI_BASE;
    reg.opaque = 0;
    reg.read = qmi_read;
    reg.write = qmi_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = XIP_AUX_BASE;
    reg.opaque = &xip_aux;
    reg.read = xip_aux_read;
    reg.write = xip_aux_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

