imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
    memset(&reg, 0, sizeof(reg));
    reg.size = XIP_MAINT_SIZE;
    reg.base = XIP_MAINT_BASE;
    reg.opaque = 0;
    reg.read = xip_maint_read;
    reg.write = xip_maint_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = DMA_SIZE;
    reg.base = DMA_BASE;
    reg.opaque = 0;
    reg.read = dma_read;
    reg.write = dma_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = HSTX_FIFO_SIZE;
    reg.base = HSTX_FIFO_BASE;
    reg.opaque = &hstx_fifo;
    reg.read = hstx_fifo_read;
    reg.write = hstx_fifo_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = BOOTRAM_SIZE;
    reg.base = BOOTRAM_BASE;
    reg.opaque = &bootram;
    reg.read = bootram_read;
    reg.write = bootram_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = TICKS_SIZE;
    reg.base = TICKS_BASE;
    reg.opaque = &ticks;
    reg.read = ticks_read;
    reg.write = ticks_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = WATCHDOG_BASE;
    reg.opaque = &watchdog;
    reg.read = watchdog_read;
    reg.write = watchdog_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = OTP_SIZE;
    reg.base = OTP_BASE;
    reg.opaque = 0;
    reg.read = otp_read;
    reg.write = otp_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = SYSINFO_BASE;
    reg.opaque = &sysinfo;
    reg.read = sysinfo_read;
    reg.write = sysinfo_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = SYSCFG_BASE;
    reg.opaque = &syscfg;
    reg.read = bank_read;
    reg.write = bank_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = PIO0_BASE;
    reg.opaque = &pio0;
    reg.read = pio_read;
    reg.write = pio_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = PIO1_BASE;
    reg.opaque = &pio1;
    reg.read = pio_read;
    reg.write = pio_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = PIO2_BASE;
    reg.opaque = &pio2;
    reg.read = pio_read;
    reg.write = pio_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = MMIO_ALIAS_SIZE;
    reg.base = TRNG_BASE;
    reg.opaque = &trng;
    reg.read = trng_read;
    reg.write = trng_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    if (!mm_rp2350_usb_register_mmio(bus)) return MM_FALSE;

    mm_gpio_bank_set_reader(rp2350_gpio_bank_read, 0);
    mm_gpio_bank_set_moder_reader(rp2350_gpio_bank_read_moder, 0);
    mm_gpio_bank_set_clock_reader(rp2350_gpio_bank_clock, 0);
    mm_gpio_set_bank_info_reader(rp2350_gpio_bank_info, 0);
    mm_rcc_set_clock_list_reader(rp2350_clock_list_line, 0);

    return MM_TRUE;
}

void mm_rp2350_mmio_reset(void)
{
    memset(&resets, 0, sizeof(resets));
    memset(&clocks, 0, sizeof(clocks));
    memset(&sio, 0, sizeof(sio));
    memset(&psm, 0, sizeof(psm));
    memset(&rp2350_mc, 0, sizeof(rp2350_mc));
    memset(&io_bank0, 0, sizeof(io_bank0));
    memset(&io_qspi, 0, sizeof(io_qspi));
    memset(&pads_bank0, 0, sizeof(pads_bank0));
    memset(&pads_qspi, 0, sizeof(pads_qspi));
    memset(&xosc, 0, sizeof(xosc));
    memset(&pll_sys, 0, sizeof(pll_sys));
    memset(&pll_usb, 0, sizeof(pll_usb));
    memset(&hstx_ctrl, 0, sizeof(hstx_ctrl));
    memset(&xip_ctrl, 0, sizeof(xip_ctrl));
    memset(&xip_aux, 0, sizeof(xip_aux));
    memset(&qmi_regs, 0, sizeof(qmi_regs));
    memset(&dma_ch0, 0, sizeof(dma_ch0));
    memset(&watchdog, 0, sizeof(watchdog));
    memset(&bootram, 0, sizeof(bootram));
    memset(otp_state.sw_lock, 0, sizeof(otp_state.sw_lock));
    mm_rp2350_boot_info_reset();
    watchdog.regs[WATCHDOG_REASON / 4u] = rp2350_watchdog_reason_pending;
    rp2350_watchdog_reason_pending = 0u;
    bootram.regs[0] = BOOTRAM_BOOT2_STUB_WORD;
    bootram.regs[BOOTRAM_FLASH_DEVINFO_OFFSET / 4u] = rp2350_flash_devinfo_value(rp2350_flash.flash_size);
    bootram.regs[BOOTRAM_BOOTLOCK_STAT / 4u] = 0xffu;
    rp2350_partition_table_init();
    memset(&ticks, 0, sizeof(ticks));
    memset(&sysinfo, 0, sizeof(sysinfo));
    memset(&syscfg, 0, sizeof(syscfg));
    memset(&pio0, 0, sizeof(pio0));
    memset(&pio1, 0, sizeof(pio1));
    memset(&pio2, 0, sizeof(pio2));
    memset(&trng, 0, sizeof(trng));
    /* Initialize SYSINFO: CHIP_ID = 0x2 (RP2350), PLATFORM = 0x1 (ASIC) */
    sysinfo.regs[SYSINFO_CHIP_ID / 4u] = 0x00000002u;
    sysinfo.regs[SYSINFO_PLATFORM / 4u] = 0x00000001u;
    mm_rp2350_usb_reset();
    mm_rp2350_coproc_reset();
    access_ctrl_reset();
    hstx_fifo_clear(&hstx_fifo);
    qmi_fifo_clear(&qmi_rx);
    qmi_fifo_clear(&qmi_tx);
    qmi_regs.regs[QMI_DIRECT_CSR / 4u] = QMI_DIRECT_CSR_RESET;

    rp2350_mc.core1_state = 1u; /* bootrom wait */
    rp2350_fifo_clear(&rp2350_mc.rx[0]);
    rp2350_fifo_clear(&rp2350_mc.rx[1]);

    resets.regs[RESETS_RESET / 4u] = 0u;
    resets.regs[RESETS_RESET_DONE / 4u] = reset_mask();

    clocks.regs[CLK_PERI_CTRL / 4u] = (1u << CLK_PERI_CTRL_ENABLE_BIT);
    clocks.regs[CLK_REF_SELECTED / 4u] = 1u;
    clocks.regs[CLK_SYS_SELECTED / 4u] = 1u;
}

static mm_u32 cp0_mask_apply(mm_u32 current, mm_u32 value, mm_u8 op)
{
    switch (op & 0x3u) {
    case 0u: return value;
    case 1u: return current ^ value;
    case 2u: return current | value;
    case 3u: return current & ~value;
    default: return current;
    }
}

static void cp0_apply_out_mask(mm_bool hi, mm_u32 value, mm_u8 op, mm_u32 allowed)
{
    value &= allowed;
    if (hi) {
        sio.out_hi = cp0_mask_apply(sio.out_hi, value, op);
    } else {
        sio.out_lo = cp0_mask_apply(sio.out_lo, value, op);
    }
    sio_sync_inputs();
}

static void cp0_apply_oe_mask(mm_bool hi, mm_u32 value, mm_u8 op, mm_u32 allowed)
{
    value &= allowed;
    if (hi) {
        sio.oe_hi = cp0_mask_apply(sio.oe_hi, value, op);
    } else {
        sio.oe_lo = cp0_mask_apply(sio.oe_lo, value, op);
    }
}

static void cp0_apply_out_mask_64(mm_u32 lo, mm_u32 hi, mm_u8 op, mm_u32 allowed_lo, mm_u32 allowed_hi)
{
    sio.out_lo = cp0_mask_apply(sio.out_lo, lo & allowed_lo, op);
    sio.out_hi = cp0_mask_apply(sio.out_hi, hi & allowed_hi, op);
    sio_sync_inputs();
}

