imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
static void cp0_apply_oe_mask_64(mm_u32 lo, mm_u32 hi, mm_u8 op, mm_u32 allowed_lo, mm_u32 allowed_hi)
{
    sio.oe_lo = cp0_mask_apply(sio.oe_lo, lo & allowed_lo, op);
    sio.oe_hi = cp0_mask_apply(sio.oe_hi, hi & allowed_hi, op);
}

static void cp0_apply_out_bit(mm_u8 bit, mm_u8 op, mm_bool conditional, mm_u32 cond_val, mm_u32 allowed_lo, mm_u32 allowed_hi)
{
    mm_u64 mask;
    if (bit >= 64u) return;
    if (bit < 32u) {
        if (((allowed_lo >> bit) & 1u) == 0u) return;
    } else {
        if (((allowed_hi >> (bit - 32u)) & 1u) == 0u) return;
    }
    if (conditional && ((cond_val & 1u) == 0u)) return;
    mask = 1ull << bit;
    if (op == 0u) {
        if ((cond_val & 1u) != 0u) {
            cp0_apply_out_mask_64((mm_u32)mask, (mm_u32)(mask >> 32), 2u, allowed_lo, allowed_hi);
        } else {
            cp0_apply_out_mask_64((mm_u32)mask, (mm_u32)(mask >> 32), 3u, allowed_lo, allowed_hi);
        }
        return;
    }
    cp0_apply_out_mask_64((mm_u32)mask, (mm_u32)(mask >> 32), op, allowed_lo, allowed_hi);
}

static void cp0_apply_oe_bit(mm_u8 bit, mm_u8 op, mm_bool conditional, mm_u32 cond_val, mm_u32 allowed_lo, mm_u32 allowed_hi)
{
    mm_u64 mask;
    if (bit >= 64u) return;
    if (bit < 32u) {
        if (((allowed_lo >> bit) & 1u) == 0u) return;
    } else {
        if (((allowed_hi >> (bit - 32u)) & 1u) == 0u) return;
    }
    if (conditional && ((cond_val & 1u) == 0u)) return;
    mask = 1ull << bit;
    if (op == 0u) {
        if ((cond_val & 1u) != 0u) {
            cp0_apply_oe_mask_64((mm_u32)mask, (mm_u32)(mask >> 32), 2u, allowed_lo, allowed_hi);
        } else {
            cp0_apply_oe_mask_64((mm_u32)mask, (mm_u32)(mask >> 32), 3u, allowed_lo, allowed_hi);
        }
        return;
    }
    cp0_apply_oe_mask_64((mm_u32)mask, (mm_u32)(mask >> 32), op, allowed_lo, allowed_hi);
}

mm_bool mm_rp2350_cp0_mcr(enum mm_sec_state sec, mm_u8 op1, mm_u8 crn, mm_u8 crm, mm_u8 op2, mm_u32 value)
{
    mm_u8 group;
    mm_bool hi;
    mm_u32 allowed_lo = access_mask_lo(sec);
    mm_u32 allowed_hi = access_mask_hi(sec);
    (void)op2;
    if (!rp2350_active) return MM_FALSE;
    if ((crn & 0x0fu) != 0u) return MM_FALSE;
    group = (mm_u8)((crm >> 2) & 0x3u);
    hi = (crm & 1u) != 0u;
    if (group == 0u) {
        if (op1 <= 3u) {
            cp0_apply_out_mask(hi, value, op1, hi ? allowed_hi : allowed_lo);
            return MM_TRUE;
        }
        if (op1 >= 5u && op1 <= 7u) {
            cp0_apply_out_bit((mm_u8)(value & 0x3fu), (mm_u8)(op1 - 4u), MM_FALSE, 1u, allowed_lo, allowed_hi);
            return MM_TRUE;
        }
    } else if (group == 1u) {
        if (op1 <= 3u) {
            cp0_apply_oe_mask(hi, value, op1, hi ? allowed_hi : allowed_lo);
            return MM_TRUE;
        }
        if (op1 >= 5u && op1 <= 7u) {
            cp0_apply_oe_bit((mm_u8)(value & 0x3fu), (mm_u8)(op1 - 4u), MM_FALSE, 1u, allowed_lo, allowed_hi);
            return MM_TRUE;
        }
    }
    return MM_FALSE;
}

mm_bool mm_rp2350_cp0_mrc(enum mm_sec_state sec, mm_u8 op1, mm_u8 crn, mm_u8 crm, mm_u8 op2, mm_u32 *value_out)
{
    mm_u8 group;
    mm_bool hi;
    mm_u32 mask;
    (void)op2;
    if (!rp2350_active || value_out == 0) return MM_FALSE;
    if ((crn & 0x0fu) != 0u) return MM_FALSE;
    if (op1 != 0u) return MM_FALSE;
    group = (mm_u8)((crm >> 2) & 0x3u);
    hi = (crm & 1u) != 0u;
    mask = hi ? access_mask_hi(sec) : access_mask_lo(sec);
    switch (group) {
    case 0u:
        *value_out = (hi ? sio.out_hi : sio.out_lo) & mask;
        return MM_TRUE;
    case 1u:
        *value_out = (hi ? sio.oe_hi : sio.oe_lo) & mask;
        return MM_TRUE;
    case 2u:
        sio_sync_inputs();
        *value_out = (hi ? sio.in_hi : sio.in_lo) & mask;
        return MM_TRUE;
    default:
        break;
    }
    return MM_FALSE;
}

mm_bool mm_rp2350_cp0_mcrr(enum mm_sec_state sec, mm_u8 op1, mm_u8 crm, mm_u32 lo, mm_u32 hi)
{
    mm_u8 group;
    mm_u32 allowed_lo = access_mask_lo(sec);
    mm_u32 allowed_hi = access_mask_hi(sec);
    if (!rp2350_active) return MM_FALSE;
    group = (mm_u8)((crm >> 2) & 0x3u);
    if (group == 0u) {
        if (op1 <= 3u) {
            cp0_apply_out_mask_64(lo, hi, op1, allowed_lo, allowed_hi);
            return MM_TRUE;
        }
        if (op1 >= 4u && op1 <= 7u) {
            mm_u8 bit = (mm_u8)(lo & 0x3fu);
            mm_bool conditional = (op1 >= 5u);
            mm_u8 op = (op1 == 4u) ? 0u : (mm_u8)(op1 - 4u);
            cp0_apply_out_bit(bit, op, conditional, hi, allowed_lo, allowed_hi);
            return MM_TRUE;
        }
        if (op1 >= 8u && op1 <= 11u) {
            mm_bool sel_hi = (hi & 1u) != 0u;
            cp0_apply_out_mask(sel_hi, lo, (mm_u8)(op1 - 8u), sel_hi ? allowed_hi : allowed_lo);
            return MM_TRUE;
        }
    } else if (group == 1u) {
        if (op1 <= 3u) {
            cp0_apply_oe_mask_64(lo, hi, op1, allowed_lo, allowed_hi);
            return MM_TRUE;
        }
        if (op1 >= 4u && op1 <= 7u) {
            mm_u8 bit = (mm_u8)(lo & 0x3fu);
            mm_bool conditional = (op1 >= 5u);
            mm_u8 op = (op1 == 4u) ? 0u : (mm_u8)(op1 - 4u);
            cp0_apply_oe_bit(bit, op, conditional, hi, allowed_lo, allowed_hi);
            return MM_TRUE;
        }
        if (op1 >= 8u && op1 <= 11u) {
            mm_bool sel_hi = (hi & 1u) != 0u;
            cp0_apply_oe_mask(sel_hi, lo, (mm_u8)(op1 - 8u), sel_hi ? allowed_hi : allowed_lo);
            return MM_TRUE;
        }
    }
    return MM_FALSE;
}

mm_bool mm_rp2350_cp0_mrrc(enum mm_sec_state sec, mm_u8 op1, mm_u8 crm, mm_u32 *lo_out, mm_u32 *hi_out)
{
    mm_u8 group;
    mm_u32 mask_lo = access_mask_lo(sec);
    mm_u32 mask_hi = access_mask_hi(sec);
    if (!rp2350_active || lo_out == 0 || hi_out == 0) return MM_FALSE;
    if (op1 != 0u) return MM_FALSE;
    group = (mm_u8)((crm >> 2) & 0x3u);
    switch (group) {
    case 0u:
        *lo_out = sio.out_lo & mask_lo;
        *hi_out = sio.out_hi & mask_hi;
        return MM_TRUE;
    case 1u:
        *lo_out = sio.oe_lo & mask_lo;
        *hi_out = sio.oe_hi & mask_hi;
        return MM_TRUE;
    case 2u:
        sio_sync_inputs();
        *lo_out = sio.in_lo & mask_lo;
        *hi_out = sio.in_hi & mask_hi;
        return MM_TRUE;
    default:
        break;
    }
    return MM_FALSE;
}

void mm_rp2350_flash_bind(struct mm_memmap *map,
                          mm_u8 *flash,
                          mm_u32 flash_size,
                          const struct mm_flash_persist *persist,
                          mm_u32 flags)
{
    (void)flags;
    (void)map;
    rp2350_flash.flash = flash;
    rp2350_flash.flash_size = flash_size;
    rp2350_flash.persist = persist;
    bootram.regs[BOOTRAM_FLASH_DEVINFO_OFFSET / 4u] = rp2350_flash_devinfo_value(flash_size);
    rp2350_partition_table_init();
}

mm_u64 mm_rp2350_cpu_hz(void)
{
    return 125000000ull;
}

mm_bool mm_rp2350_access_check(mm_u32 addr, enum mm_sec_state sec, mm_bool privileged)
{
    mm_u32 reg;
    if (!rp2350_active) return MM_TRUE;
    reg = access_ctrl_reg_for_addr(addr);
    if (reg == 0u) return MM_TRUE;
    return access_ctrl_allow(reg, sec, privileged);
}

mm_bool mm_rp2350_flash_erase(mm_u32 flash_offs, mm_u32 count)
{
    if (rp2350_flash.flash == 0 || rp2350_flash.flash_size == 0) return MM_FALSE;
    if (count == 0u) return MM_TRUE;
    if (flash_offs >= rp2350_flash.flash_size) return MM_FALSE;
    if (flash_offs + count > rp2350_flash.flash_size) return MM_FALSE;
    memset(rp2350_flash.flash + flash_offs, 0xff, count);
    if (rp2350_flash.persist != 0 && rp2350_flash.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)rp2350_flash.persist, flash_offs, count);
    }
    return MM_TRUE;
}

mm_bool mm_rp2350_flash_program(struct mm_memmap *map,
                                enum mm_sec_state sec,
                                mm_u32 flash_offs,
                                mm_u32 data_addr,
                                mm_u32 count)
{
    mm_u32 i;
    if (rp2350_flash.flash == 0 || rp2350_flash.flash_size == 0 || map == 0) return MM_FALSE;
    if (count == 0u) return MM_TRUE;
    if (flash_offs >= rp2350_flash.flash_size) return MM_FALSE;
    if (flash_offs + count > rp2350_flash.flash_size) return MM_FALSE;
    for (i = 0; i < count; ++i) {
        mm_u8 b = 0xffu;
        if (!mm_memmap_read8(map, sec, data_addr + i, &b)) {
            return MM_FALSE;
        }
        rp2350_flash.flash[flash_offs + i] &= b;
    }
    if (rp2350_flash.persist != 0 && rp2350_flash.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)rp2350_flash.persist, flash_offs, count);
    }
    return MM_TRUE;
}

mm_bool mm_rp2350_flash_erase_all(void)
{
    if (rp2350_flash.flash == 0 || rp2350_flash.flash_size == 0) return MM_FALSE;
    memset(rp2350_flash.flash, 0xff, rp2350_flash.flash_size);
    if (rp2350_flash.persist != 0 && rp2350_flash.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)rp2350_flash.persist, 0u, rp2350_flash.flash_size);
    }
    return MM_TRUE;
}

mm_u32 mm_rp2350_otp_access(enum mm_sec_state sec,
                            mm_u32 flags,
                            mm_u8 *data,
                            mm_u32 len)
{
    mm_u32 row = flags & RP2350_OTP_CMD_ROW_BITS;
    mm_u32 page = row / 0x40u;
    mm_bool write = (flags & RP2350_OTP_CMD_WRITE_BITS) != 0u;
    mm_bool ecc = (flags & RP2350_OTP_CMD_ECC_BITS) != 0u;
    mm_u8 *row_data;
    mm_u8 *otp_data;
    mm_u32 i;
    mm_u32 lock = 0u;
    mm_u32 lock_mode = 0u;
    mm_bool row_empty = MM_FALSE;

