imbluedabr/m33mu/cpu/rp2350/rp2350_mmio.c
    if (data == 0 || len == 0u) return RP2350_BOOTROM_ERROR_INVALID_ARG;
    if (row >= RP2350_OTP_ROW_COUNT) return RP2350_BOOTROM_ERROR_INVALID_ARG;
    if (page < RP2350_OTP_SW_LOCK_COUNT) {
        lock = otp_state.sw_lock[page];
        if (sec == MM_SECURE) {
            lock_mode = lock & 0x3u;
        } else {
            lock_mode = (lock >> 2) & 0x3u;
        }
        if (lock_mode == 3u) {
            return RP2350_BOOTROM_ERROR_NOT_PERMITTED;
        }
        if (write && lock_mode != 0u) {
            return RP2350_BOOTROM_ERROR_NOT_PERMITTED;
        }
    }
    otp_data = mm_otp_data(&otp_state.otp);
    if (otp_data == 0) return RP2350_BOOTROM_ERROR_INVALID_ARG;
    row_data = otp_data + (row * RP2350_OTP_ROW_BYTES);
    row_empty = MM_TRUE;
    for (i = 0; i < RP2350_OTP_ROW_BYTES; ++i) {
        if (row_data[i] != 0xffu) {
            row_empty = MM_FALSE;
            break;
        }
    }
    if (ecc) {
        if ((len & 1u) != 0u) return RP2350_BOOTROM_ERROR_BAD_ALIGNMENT;
        if (len > RP2350_OTP_ROW_BYTES) return RP2350_BOOTROM_ERROR_INVALID_ARG;
        if (write) {
            mm_u8 tmp[RP2350_OTP_ROW_BYTES];
            for (i = 0; i < len; ++i) {
                tmp[i] = (mm_u8)(~data[i]);
            }
            if (!mm_otp_write(&otp_state.otp, row * RP2350_OTP_ROW_BYTES, tmp, len)) {
                return RP2350_BOOTROM_ERROR_UNSUPPORTED_MODIFICATION;
            }
            return 0u;
        }
        if (row_empty) {
            memset(data, 0, len);
            return 0u;
        }
        if (!mm_otp_read(&otp_state.otp, row * RP2350_OTP_ROW_BYTES, data, len)) {
            return RP2350_BOOTROM_ERROR_INVALID_ARG;
        }
        for (i = 0; i < len; ++i) {
            data[i] = (mm_u8)(~data[i]);
        }
        return 0u;
    }

    if ((len & 3u) != 0u) return RP2350_BOOTROM_ERROR_BAD_ALIGNMENT;
    if ((len / 4u) * 3u > RP2350_OTP_ROW_BYTES) return RP2350_BOOTROM_ERROR_INVALID_ARG;
    if (write) {
        mm_u32 word_count = len / 4u;
        for (i = 0; i < word_count; ++i) {
            mm_u32 base = i * 4u;
            mm_u32 store = i * 3u;
            mm_u8 b0 = data[base + 0u];
            mm_u8 b1 = data[base + 1u];
            mm_u8 b2 = data[base + 2u];
            mm_u8 tmp[3];
            tmp[0] = (mm_u8)(~b0);
            tmp[1] = (mm_u8)(~b1);
            tmp[2] = (mm_u8)(~b2);
            if (!mm_otp_write(&otp_state.otp, (row * RP2350_OTP_ROW_BYTES) + store, tmp, 3u)) {
                return RP2350_BOOTROM_ERROR_UNSUPPORTED_MODIFICATION;
            }
        }
        return 0u;
    }

    {
        mm_u32 word_count = len / 4u;
        if (row_empty) {
            memset(data, 0, len);
        } else {
            for (i = 0; i < word_count; ++i) {
                mm_u32 base = i * 4u;
                mm_u32 store = i * 3u;
                data[base + 0u] = (mm_u8)(~row_data[store + 0u]);
                data[base + 1u] = (mm_u8)(~row_data[store + 1u]);
                data[base + 2u] = (mm_u8)(~row_data[store + 2u]);
                data[base + 3u] = 0u;
            }
        }
    }
    return 0u;
}

void mm_rp2350_otp_init(const char *target_name)
{
    mm_otp_init(&otp_state.otp, target_name, RP2350_OTP_ROW_COUNT * RP2350_OTP_ROW_BYTES);
}

mm_u32 mm_rp2350_flash_size(void)
{
    return rp2350_flash.flash_size;
}

mm_u32 mm_rp2350_partition_table_addr(void)
{
    return BOOTRAM_BASE + BOOTRAM_PARTITION_TABLE_OFFSET;
}

const struct rp2350_partition_table *mm_rp2350_partition_table_get(void)
{
    return rp2350_partition_table_ptr_const();
}

struct rp2350_partition_table *mm_rp2350_partition_table_get_mut(void)
{
    return rp2350_partition_table_ptr();
}

const struct rp2350_boot_info *mm_rp2350_boot_info_get(void)
{
    return &rp2350_boot_info;
}

void mm_rp2350_set_active_core(mm_u32 core_id)
{
    rp2350_mc.active_core = core_id & 1u;
}

void mm_rp2350_bind_multicore(struct mm_cpu *core0,
                              struct mm_cpu *core1,
                              struct mm_nvic *nvic0,
                              struct mm_nvic *nvic1,
                              mm_u32 *active_core)
{
    rp2350_mc.cpu[0] = core0;
    rp2350_mc.cpu[1] = core1;
    rp2350_mc.nvic[0] = nvic0;
    rp2350_mc.nvic[1] = nvic1;
    rp2350_mc.active_core_ptr = active_core;
}

mm_bool mm_rp2350_core1_running(void)
{
    return rp2350_mc.core1_state == 2u ? MM_TRUE : MM_FALSE;
}

mm_bool mm_rp2350_core1_can_reset(void)
{
    return (rp2350_mc.core1_state != 2u) ? MM_TRUE : MM_FALSE;
}

mm_bool mm_rp2350_core1_take_launch(mm_u32 *vtor_out, mm_u32 *sp_out, mm_u32 *entry_out)
{
    if (rp2350_mc.launch_pending == 0u) {
        return MM_FALSE;
    }
    printf("[RP2350] core1 start vtor=0x%08lx sp=0x%08lx entry=0x%08lx\n",
           (unsigned long)rp2350_mc.launch_vtor,
           (unsigned long)rp2350_mc.launch_sp,
           (unsigned long)rp2350_mc.launch_entry);
    rp2350_mc.launch_pending = 0u;
    if (vtor_out) *vtor_out = rp2350_mc.launch_vtor;
    if (sp_out) *sp_out = rp2350_mc.launch_sp;
    if (entry_out) *entry_out = rp2350_mc.launch_entry;
    return MM_TRUE;
}
